[
    {
        "idx": 1,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7126221517993951233/",
        "Post Description": "35 years of experience plus 94 students? It equals one awesome Gregory Kiefer as a guest speaker in our business analytics class! \n\nThank you Greg for sharing your experience about analytics project scoping and change management with our students. We learned so much.\n\n#got_ucdavis_msba #project_management #businessanalytics",
        "Likes": 57,
        "Shares": 1,
        "Number of Comments": 5
    },
    {
        "idx": 2,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7123337483265703936/",
        "Post Description": "Congratulations to Huzaifa Hussain of ​New Mexico State, Alex Antholzner  of New Mexico State, and Huifeng Su of Yale on their victory in the Freestyle OR Supreme contest, sponsored this year by DataPrime.AI and delivered by DataPrime founder Aaron Burciaga, CAP, ACE.  \n\nWant to start your AI augmentation small and scale it fast?  Check out DataPrime.AI's microservices for your tech stack.\n\nWant to learn what it will take to win the next generation?  Ask Huzaifa, Alexander and Huifeng.\n\nWant to compete or sponsor next year?  Reach out to me - we are always talking.\n\n#FreestyleORSupreme #analytics #INFORMS2023 #Phoenix #somelikeithot #got_ucdavis_msba #problemframing",
        "Likes": 35,
        "Shares": 3,
        "Number of Comments": 0
    },
    {
        "idx": 3,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7122419690013945856/",
        "Post Description": "\"Ask me anything!\"  \"Analytics!\"  \"Happy Hour this Friday!\"  \n\nThree phrases - individually all good; together beyond fantastic.  \n\nThis Friday, 5 pm Eastern - early career professionals encouraged to attend.     #informs #analytics #got_ucdavis_msba ",
        "Likes": 10,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Robin Lougee, PhD",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7122401528748888064/",
            "Original Post Description": "Are you an early career analytics professional with questions you don't want to ask at work?  Join co-hosts Mei Zhang and Tarun Mohan Lal on Friday, Oct 27 at 5pm Eastern for a virtual, networking happy hour discussion dedicted to your questions. Free registration at https://lnkd.in/eu5W56V.  Hope to see you there. \n#INFORMS #advancedanalytics #datascience #operationsresearch #AI #ML  #earlycareer #networking",
            "Original Likes": 18,
            "Original Shares": 8,
            "Original Number of Comments": 1
        }
    },
    {
        "idx": 4,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7120770652680187904/",
        "Post Description": "Got leadership?  Help a Ph.D. student complete the research he needs for his dissertation.  I know Martin Payne personally and would consider it a great favor to me if you could complete his survey.  Join the many helpful people who are already helping the next generation of scholars emerge.    \n\nhttps://lnkd.in/ghyt2jxU",
        "Likes": 2,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Martin Payne",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7117990284575051776/",
            "Original Post Description": "The psychological well-being of leaders directly impacts organizational outcomes, team morale, and innovation rates.\nhttps://lnkd.in/gJEbnqep\nI'm researching Leader Psychological Safety for my doctoral study and reaching out to all leaders in organizations with 500+ employees. If you've ever felt the weight of leadership and believe in creating a safer, more inclusive space for leaders to thrive, I'd love your insights! Join this research and be part of the change. 🚀\nI need an additional 250 participants - please help. Survey closes soon. Even better - Like and repost to your network!\n#psychologicalsafety #dissertation #managment #leadership #USC",
            "Original Likes": 102,
            "Original Shares": 196,
            "Original Number of Comments": 22
        }
    },
    {
        "idx": 5,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7119796668392243200/",
        "Post Description": "Everybody wins, or one solution to rule them all?\n\nShould undergrad case study exercises be an “everybody wins” situation, where all entrants receive a prize? Or should there be just one winner?\n\nIt was a lot of fun discussing this question with Matthew A. Lanham , Cody Baldwin , and Steven Moss at #INFORMS2023 in #phoenix.\n\nWould love to hear from the audience: do plentiful prizes breed entitlement, or do they encourage those who might not otherwise participate?",
        "Likes": 51,
        "Shares": 0,
        "Number of Comments": 4
    },
    {
        "idx": 6,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7119174863033954304/",
        "Post Description": "Experiential learning, case studies and animation - all we need is you! \n\n#INFORMS2023",
        "Likes": 11,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Gabriela Gongora-Svartzman, Ph.D.",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7117841277575905282/",
            "Original Post Description": "The Committee on Teaching and Learning and Education Outreach Cluster proudly presents the following Sessions at the 2023 INFORMS Annual Meeting.\nJoin us!!\n\nSunday, October 15th \n\n⏰ 8:00 AM | 📍 West 212B\n🧐🔍 INFORMS: Creating Value for Graduate Students\n👤 Chair: Richard Staats\n👥 Panelists: Matthew A. Lanham, Goutam Chakraborty, Richard Staats\n\n⏰ 10:45 AM | 📍 West 212B\n📚Animating the Analytics\n👤 Chair: Sourav Chatterjee\n👥 Presenters: Kelly Slaughter, Matthew A. Lanham, Prakash Shrivastava, Stephen Robertson\n\n⏰ 12:45 PM | 📍 West 212B\n📚The Importance of Mentorship in O.R./Analytics Fields\n👤 Chair: Gabriela Gongora-Svartzman, Ph.D.\n👥 Presenters: Christopher Thomas Ryan, Richard Forrester, Kevin Hutson, Gabriela Gongora-Svartzman, Ph.D., Larry Heimann\n\n⏰ 2:15 PM | 📍 West 212B\n🧐🔍K-12 Education Outreach in a Post-COVID World\n👤 Chair: Zihan Zhang\n👥 Panelists: Afrooz Jalilzadeh, Pascal Van Hentenryck, Mary Ogidigben, LSSGB\n\n⏰ 4:00 PM | 📍 North 227B \n📚Data-driven Innovations in O.R. Education\n👤 Chair: Jeroen Belien, Thomas Grossman\n\n⏰ 4:00 PM | 📍 West 212B \n🧐🔍 Undergraduate Outreach through Case Competitions: Benefits and Challenges\n👤 Chair: Steve Moss\n👥 Panelists: Cody Baldwin, Matthew Lanham, Carrie Beam, Ph.D. \n\n—\nMonday, October 16th \n\n⏰ 8:00 AM | 📍 West 212B\n🧐🔍 Managing Experiential Learning in Business Analytics\n👤 Chair: Ken Murphy\n👥 Panelists: Jeff Camm, Goutam Chakraborty, Brett Duarte, Janet Moss, Bill Griffin\n\n⏰ 10:45 AM | 📍 West 212B\n📚Data Analytics Teaching and Business Applications\n👤 Chair: Timothy Anderson\n👥 Presenters: Wang Kedi, Frederick Kelly Augustine, Timothy R Anderson\n\n⏰ 12:45 PM | 📍 West 212B\n📚 Innovative Approaches to Analytics Knowledge Transfer\n👤 Chair: Alessandro Hill\n👥 Presenters: Orcun Temizkan, Marcy Jance, Alessandro Hill\n\n—\nTuesday, October 17th \n\n⏰ 8:00 AM | 📍 North 227B\n🧐🔍Publishing in INFORMS Transactions on Education\n👤 Chair: Stefan Creemers\n👥 Panelists: Stefan Creemers, Jeroen Belien, Dries Goossens, Craig Fernandes, Thomas Grossman\n\n⏰ 10:45 AM | 📍 North 227B \n🧐🔍Panel Discussion: Implementing Experiential Learning for Analytics Across Diverse Academic Settings\n👤 Chair: Carrie Beam, Ph.D., Sanjay Saigal\n👥 Panelists: Polly Mitchell-Guthrie, Janet Moss, Eric Specking\n\n\nStay engaged in these thought-provoking sessions and maximize your INFORMS Annual Meeting experience. Don't forget to use #INFORMS2023 to connect with fellow attendees and keep up with the latest insights. See you in Phoenix! 👥\n\n🌵 #Teaching #learning #education  #INFORMS2023 #Phoenix #Conference ",
            "Original Likes": 48,
            "Original Shares": 8,
            "Original Number of Comments": 2
        }
    },
    {
        "idx": 7,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7117344825053495297/",
        "Post Description": "DataPrime will be this year's sponsor of Freestyle OR Supreme at #INFORMS Phoenix 2023.   Did we have you at DataPrime, or should we also mention sensor-fusion, mechatronics, distributed AI systems, and reinforcement learning with human feedback?  Swag and a trophy?\n\nCome to hear special remarks and invitation to network with global AI influencers including Kirk Borne, Ph.D. , Jordan Morrow, and Aaron Burciaga, CAP, ACE. \n\nSwag and prizes for all participants!  Students and full spectrum of career (early to retired) professionals welcome to play.  \n\nAs preview and teaser to year's problem, come prepared to design the future of how AI systems and workforce can be optimized to ensure security and prosperity across industry, government, and academia. \n\nSensor-fusion, mechatronics, distributed AI systems, and reinforcement learning with human feedback will take center stage in the full scenario and problem statement you and your team will compete to frame the problem and propose solutions using the INFORMS #JobTaskAnalysis framework. \n\nThis real-world problem is perfect for the INFORMS Annual Meeting inasmuch that creative solutions, fresh perspectives, and spirited approaches will be needed to surmount the challenge presented on gameday! \n\nRegister to compete! The members of the winning team will each receive the award shown here as well as recognition across social media by Kirk, Jordan, and Aaron of their victory and launch of an exciting young career!\n\nSign up here:  https://lnkd.in/gZCn8nsw",
        "Likes": 25,
        "Shares": 6,
        "Number of Comments": 2
    },
    {
        "idx": 8,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7114754644156813314/",
        "Post Description": "It's time ... for FREESTYLE OR SUPREME!  \n\nSignups now open for our student \"frame that problem\" game at #INFORMS Phoenix 2023.  This is a fast-moving game show in which sponsor DataPrime will present a real-world analytics problem, and student teams compete to frame the problem using the INFORMS #JobTaskAnalysis framework.  \n\nNo prior experience is necessary; just sign up and show up to play.  \n\nFame and glory await - must attend conference to play - must play to win.  \n\nMay the odds be ever in your favor!\n\nSignups here:  https://lnkd.in/g_YFZnmr\n\n#analytics Aaron Burciaga, CAP, ACE Lance Kallman #problemframing #got_ucdavis_msba",
        "Likes": 25,
        "Shares": 8,
        "Number of Comments": 1
    },
    {
        "idx": 9,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7113553028649021440/",
        "Post Description": "Does your Friday need a brief but glorious podcast which covers data science, DEI, Deming's red beads, and the work mullet, with questions asked by a TED talk speaker of a PhD? You're in luck. \n\nI was delighted to be interviewed by TEDxPleasanton speaker Belle Walker   as a follow-up to my facilitation of an Inclusive Leadership in a Virtual World (ILVW) session. Episode 65 is here: https://lnkd.in/gnBCzDnA\n\n🧡  this so much you want to register and go to the next one?  All are invited to the weekly sessions of Inclusive Leadership in a Virtual World, Wednesdays at 10 am Pacific time.  Register here: https://lnkd.in/gA6VKZEH\n\nAs always, a big thank you to Matthew Cahill Sejal Thakkar Steven Terusaki Susan Schwartz, MS PMP ☀️Brad Kewalramani, B.Eng for helping us all see the world in a different, more inclusive way.\n\n#analytics #dei #got_ucdavis_msba ",
        "Likes": 22,
        "Shares": 2,
        "Number of Comments": 6
    },
    {
        "idx": 10,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7111023849835565057/",
        "Post Description": "It's Freestyle OR Supreme time! Game show meets analytics and AI - what's not to love? Come join us at the INFORMS annual meeting in Phoenix in October where our student contestants will frame and solve a real analytics problem in one hour of glory.   Picture from last year, where Damian Herrick brought us a great problem.  Want to play this year? Leave a comment below. May the odds be ever in your favor.  (Did you jam with us last year?  Tag us in comments!)",
        "Likes": 36,
        "Shares": 3,
        "Number of Comments": 0
    },
    {
        "idx": 11,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7109684195995635713/",
        "Post Description": "Got your supply chain software up and running but forgot the seat belt? Worried about uninvited guests hacking into your monetized data? These things are not for the junior varsity. At ProVisors BADAM last week I learned that Alex Rayter  of P20 (https://lnkd.in/gxtiMG6b) ,a Managed IT & CyberSecurity Provider, has a list of Essential Controls for Securing Data Workloads in the Cloud.  He’s is willing to share; leave your name in comments if you'd like the info. Thank you Alex for your generosity and thank you Jaco Grobbelaar for the invitation to speak on what technology is needed to succeed in supply chain analytics. #analytics #supplychain #got_ucdavis_msba #ucdavis",
        "Likes": 15,
        "Shares": 1,
        "Number of Comments": 1
    },
    {
        "idx": 12,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7107837862103969792/",
        "Post Description": "$300 billion in recognized benefits and counting, baby!  Don't let Walmart have all the fun...\n\nhttps://lnkd.in/gFZrJFP6 \n\nNow that I have your attention, we need YOU to help raise that $300 billion number beyond what even Walmart did.  The Franz Edelman Award Competition is now accepting submissions for 2024. This INFORMS award recognizes and rewards outstanding examples of operations research, management science, and advanced analytics. \n\nThink of a recent project that you have completed: think of its impact, the money, time, or lives saved. \n\nShouldn’t you share that with the world?!\nThe Edelman Competition showcases the six best advanced analytics and operations research projects each year – 2024 could be your year to win!\n\nTL;DR:  Deadline to apply for this year's Edelman is October 1.  \n\nDetail-oriented data scientist type who wants to know the nitty-gritty?  See the INFORMS Edelman 2024 webpage\n https://lnkd.in/g2_9bc4e   \nfor details. \n\nAnd all of you - I'm a past coach, past judge, and past chair - so I mean it when I say this is the good stuff.  ",
        "Likes": 17,
        "Shares": 1,
        "Number of Comments": 0
    },
    {
        "idx": 13,
        "User": "Kinaxis",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7107019660365099009/",
        "Post Description": "The Kinaxis #AcademicProgram is shaping the future of #SupplyChain success. 🚀 In 2022 alone, we reached over 3,600 students at leading universities globally through guest lectures, case studies and certifications.\n\nSee how we’re empowering the next generation of #SupplyChains in our new Global Impact Report: https://bit.ly/3R0IHjq ",
        "Likes": 173,
        "Shares": 6,
        "Number of Comments": 7
    },
    {
        "idx": 14,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7105638786201518080/",
        "Post Description": "Open to work? Think pulsESG! Do you have a knack for getting things done, and can you speak tech and talk client? This is a fantastic early stage start up opportunity.  Inderjeet Singh  and his team are the real thing.\n\n#ucdavis #got_ucdavis_msba #esg",
        "Likes": 8,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Jeannie Blackwood",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7105209460008128512/",
            "Original Post Description": "pulsESG is HIRING! and specifically looking for an IMPLEMENTATION ROCKSTAR!!!\n\nLooking for someone who can understand the clients requirements, empathize with their needs, be a product expert, manage product roadmap items with inflight implementations, advocate for the customer needs to the engineering team, keep projects on time and on budget, juggle multiple things at the same time in an extremely fast passed environment, not drop any balls,  and make the client love them! \n\nThis role would be working with our largest enterprise clients, learning the ins and outs of their sustainability practice, traveling to meet them, and being fully in charge of making these clients referenceable. \n\npulsESG has doubled our onshore team in the past 4 months and we are just getting started. 🚀🚀 This is an opportunity to be sub 25 employees and help build an incredible business. \n\nI have had the absolute pleasure of working with many individuals who are absolute rockstars at the above : Matthew Kordonowy, Andrew M., Connor Chapman, Hannah Wilson, Susan Cobb, Megan (Francisco) Harrison, Sagar Shukla, Garrett Evans, and many others - unfortunately they are all doing their own incredible things these days, but I am hopeful that they can help me find the perfect fit for this role!\n\nhttps://lnkd.in/gM9MeaPT\n\n#implementation #enterprisesaas #hiring #startup #rockstar #sustainability #esg ",
            "Original Likes": 56,
            "Original Shares": 14,
            "Original Number of Comments": 5
        }
    },
    {
        "idx": 15,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7105355027849887744/",
        "Post Description": "Open to work? Public sector management consulting? You can’t do better than to work with Mike Cappelluti at The Highlands. I have worked with them in the past and can personally vouch for their integrity and professionalism. Apply today! #hiring",
        "Likes": 12,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "The Highlands Consulting Group LLC",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7101761848529584128/",
            "Original Post Description": "We’re #hiring a new Public Sector Management Consultant in Sacramento, California. Apply today or share this post with your network.",
            "Original Likes": 11,
            "Original Shares": 9,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 16,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7100854358677880832/",
        "Post Description": "What data and technology is needed to compete in today's manufacturing sector? How can distributors monetize the data they already have? \n\nYou're invited: I'm delighted to be speaking at ProVisors' BADAM (Bay Area Distributors and Manufacturers) on Wednesday, September 6 at noon Pacific time. Come learn about the risk/reward tradeoffs of descriptive, predictive, and prescriptive analytics. See where AI fits in, and learn how preventive maintenance and dashboard visualizations can be low risk but high reward.  \n\nContact Jaco Grobbelaar of BroadVision Marketing (jaco@broadvisionmarketing.com) if you'd like to attend. Thank you Jaco Grobbelaar  for the invitation!\n\n#ProVisors #BADAM #manufacturing #supplychain #UCDavisMSBA #got_ucdavis_msba",
        "Likes": 21,
        "Shares": 4,
        "Number of Comments": 0
    },
    {
        "idx": 17,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7099564745912975360/",
        "Post Description": "Come work at UCOP!  Please see below for a job posting which requires strong quantitative skills, ability to develop forecasts, excellent communication skills and promises some data integration work.  #got_ucdavis_msba #UCDavisMSBA",
        "Likes": 14,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 18,
        "User": "University of California, Davis - Graduate School of Management",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7092919481336795136/",
        "Post Description": "The 2024 application is OPEN for Full-Time MBA and M.S. in Business Analytics programs! 🎉 Click here to get started: https://bit.ly/3DIOUIU\n\n▶️ Full-Time MBA Round One Deadline: 10/18/23\n▶️ MSBA Round One Deadline: 10/4/23",
        "Likes": 26,
        "Shares": 4,
        "Number of Comments": 0
    },
    {
        "idx": 19,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7093251741273522176/",
        "Post Description": "Will AI eat your job? As you gain clients, will your product have diminishing returns, or will it become exponentially more valuable? And what if you run a bricks and mortar business that survived Amazon.com - will you make it through this latest round of AI tech change?\n\nI highly recommend \"Competing in the Age of AI\" by Iansiti and Lakhani of Harvard Business School, especially if you are a normal human, a business executive, or an MBA - you don't have to be a data scientist to understand. They weave strategy and data science together to show how, for example, something like Facebook becomes more valuable with more users, while other products lose their shine.  \n\nThis is one of the textbooks we're using in our UC Davis MSBA program this fall. Our students learn not only Python and data visualization, but also the underlying business strategy and how to make money from these things. \n\nAnybody else have a book on the subject they would recommend?\n\n#got_ucdavis_msba #ucdavis #msba #strategy #ai\n\nhttps://lnkd.in/gmKbtWwK",
        "Likes": 23,
        "Shares": 4,
        "Number of Comments": 7
    },
    {
        "idx": 20,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7090699925558079491/",
        "Post Description": "Did your last highly technical presentation put the whole team to sleep? Worried that you left the audience dazed and confused?\n\nThere is a better way. We use Bill Franks' Winning The Room  textbook to teach our students how to communicate highly technical stuff to a business audience.\n\nOne sneak peek: on p. 173, Bill says, 'Put the cause on the X-axis.' Why is this so helpful? Most humans intuitively look on the bottom of a graph for the quantity they can control, and then look up on the side for the result. Laying out your graphs in this manner aligns the technical display with the intuitive expectations of your audience.  (Inspired?  Get your own copy here:  https://lnkd.in/gseB-jya) \n\nOur graduates are able to not only crunch your data and uncover the story, but are also able to communicate that to a business audience.\n\n#got_ucdavis_msba #communication #businessanalytics Bill Franks\n",
        "Likes": 22,
        "Shares": 4,
        "Number of Comments": 4
    },
    {
        "idx": 21,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7090229895837990912/",
        "Post Description": "Your path to AI and Data Analysis Excellence - with some California cheese and Swiss chocolate to boot.  What more could a busy executive want?  #AI #IOT  #DataAnalytics #ExecutiveEducation",
        "Likes": 6,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "University of California, Davis - Graduate School of Management",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7090089702535372801/",
            "Original Post Description": "Registration is open for a new executive certificate program from UC Davis Graduate School of Management and ZHAW Zurich University of Applied Sciences. \n\n-Designed for executives and managers in data-intensive sectors such as finance, insurance, healthcare, marketing, customer analytics, and industries impacted by the data revolution and IoT.\n-Asynchronous lessons allow you to tailor your learning experience to fit your schedule. Complete in five months.\n\nClasses begin October 2. Learn more: https://bit.ly/3O26yfq #AI #IoT #DataAnalytics #ExecutiveEducation",
            "Original Likes": 24,
            "Original Shares": 10,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 22,
        "User": "Kathryn Zawisza",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7085039808338612224/",
        "Post Description": "The University of Arkansas is looking for a research facilitator! Come join our team!",
        "Likes": 12,
        "Shares": 3,
        "Number of Comments": 0
    },
    {
        "idx": 23,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7085634051813904384/",
        "Post Description": "\"If you have a brain, you have a bias\" ~ Matthew Cahill\n\nWhat does data science have to do with personal bias? Join us and find out!\n\nI am delighted to facilitate an Inclusive Leadership in a Virtual World (#ILVW) session Wednesday July 19, 10am Pacific. We will discuss how data science can uncover and correct systematic bias. All are invited - register here: https://lnkd.in/gA6VKZEH \n\n#ILVW #provisors #data_viz #analytics #leadership\n\nThank you Susan Schwartz, MS PMP and Matthew Cahill for the invite and Roberta Guise DTM for everything.",
        "Likes": 26,
        "Shares": 0,
        "Number of Comments": 1
    },
    {
        "idx": 24,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7083473272998146048/",
        "Post Description": "Five minute favor: Can you share with your networks, esp educators? (I posted to my Facebook also.) \n\nVouch:  Kyron Learning has been a great partner to my UC Davis MSBA (masters of science in business analytics) students and boosting this signal is one small way to give back to this company. \n\nIn other words, Pavel Sirotin  is for real 😄.\n\n#educators #ai  #got_ucdavis_msba",
        "Likes": 5,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Pavel Sirotin",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7083114804936151040/",
            "Original Post Description": "We’re looking for 100 outstanding educators to join Kyron’s K-12 Collective and help build the most responsible and effective AI-powered learning platform for all students.\n\nIf you know anyone, send them the link.\n\nhttps://lnkd.in/gyywywjF\n\n#educators #learning #ai ",
            "Original Likes": 26,
            "Original Shares": 5,
            "Original Number of Comments": 2
        }
    },
    {
        "idx": 25,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7079095971879555072/",
        "Post Description": "Want to avoid ending up with bad market research data? \n\nWhat are the best tools to process and centralize and analyze the data? \n\nWhat do the best marketers do with their data scientists in the age of ChatGPT? \n\nJill Feldman, Ken Scales and I are looking forward to speaking to these questions at Bay Area Branding, Licensing, IP and Strategic Services Affinity Group on Tuesday. Thank you Daniel Shulman, Angela Dunz, MBA Garrett Goldman for the invitation. #provisors #babliss #branding #marketing #machinelearning #artificialintelligence",
        "Likes": 34,
        "Shares": 2,
        "Number of Comments": 1
    },
    {
        "idx": 26,
        "User": "University of California, Davis - Graduate School of Management",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7075956254010994688/",
        "Post Description": "Welcome to our newest Aggie alumni! We can’t wait to see what you achieve next.\n\nToday’s Commencement recording is available for re-play on YouTube: 🎥 https://lnkd.in/gW_GC-Wz\n\n#UCDavisGrad #Classof2023",
        "Likes": 194,
        "Shares": 9,
        "Number of Comments": 2
    },
    {
        "idx": 27,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7075945245586198528/",
        "Post Description": "Congratulations to the UC Davis MSBA Class of 2023! Super proud of you all. #ucdavis #got_ucdavis_msba #UCDavisGrad GSM Class of 2023",
        "Likes": 79,
        "Shares": 0,
        "Number of Comments": 3
    },
    {
        "idx": 28,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7065088471849205760/",
        "Post Description": "What a pleasure to welcome Heather C. Liston, CFP®, EA of Clarity Financial as a guest speaker to our UC Davis Practicum Class! Heather covered the ins and outs of RSUs, the US tax code, stock options and even let us know about 83(b) elections. For our graduating students entering the job market, this is invaluable information - thank you Heather!",
        "Likes": 36,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 29,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7053961741717651456/",
        "Post Description": "Congratulations to Walmart, the 2023 Franz Edelman prize winner! #informs2023 #analytics - and congratulations to all of the Edelman finalists. You are all truly saving money, doing good, saving lives.\n\nFor you lawyers and poets out there, Walmart won THE analytics competition by using math and computers to put the right stuff on the right shelf at the right time, and use the right truck to get it there.  This problem gets super hard when you have a whole bunch of stores and need to do it fast, and so they solved that too.\n\nThanks to Walmart’s analytics, the parents of the world won’t run out of diaper wipes and the artists never run out of duct tape. The lawyers will always find printer paper, and the poets will never run out of inspiration.\n\nOperations research and analytics: the science of better.",
        "Likes": 35,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "INFORMS",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7053954456295464960/",
            "Original Post Description": "[Live from Aurora] Congratulations, Walmart Global Tech, Walmart -winner of the 2023 Franz Edelman Award! \nResearch Enhances Retail Truck Routing and Load Planning: Walmart Awarded the 2023 INFORMS Edelman Award https://bit.ly/3A4WI64",
            "Original Likes": 74,
            "Original Shares": 16,
            "Original Number of Comments": 2
        }
    },
    {
        "idx": 30,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7053558642486251521/",
        "Post Description": "🚗🚕🚙🚌🚎🎉 #reinforcementlearning with #lyft, #edelman and #informs2023 - picture is with Team Lyft competitors Sébastien Martin and Zhiwei (Tony) Qin and my fellow Lyft coach Joyce Weiner. Tomorrow is the Edelman competition: best of luck to all! INFORMS Sébastien Martin",
        "Likes": 73,
        "Shares": 3,
        "Number of Comments": 2
    },
    {
        "idx": 31,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7051986095479164928/",
        "Post Description": "Business folks - curious about how to get your #supplychain more #profitable? Thanks to Jerry Abiog and Cathy McCorquodale at https://lnkd.in/gx_Xp2Zh for an easy to read primer.  Hint: RFID, not ChatGPT.   \n",
        "Likes": 20,
        "Shares": 0,
        "Number of Comments": 2
    },
    {
        "idx": 32,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7043595645063991297/",
        "Post Description": "#hiring #informs Boosting the signal. INFORMS is a great organization. Leadership rocks. And math and #operationsresearch  research are more fashionable than ever, thanks in part to #ai. Don’t be shy - share with your network today!",
        "Likes": 4,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Elena Gerstmann, PhD, ACC, FASAE, CAE",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7042959273793839104/",
            "Original Post Description": "Are you looking for a great job at a great organization? We may be looking for you. This position is part of the leadership team. We need a go-getter with a proven track record. See information below. Reach out to me with questions. \nhttps://lnkd.in/d2t52VKJ\nASAE: The Center for Association Leadership Council of Engineering and Scientific Society Executives (CESSE)",
            "Original Likes": 30,
            "Original Shares": 3,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 33,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7041777584329682945/",
        "Post Description": "#datasciencejobs  #opportunity #hiring .  Fashion-tech startup looking for data scientist (5+ years experience) coming on board part time on an equity basis. Tech stack is Python plus the usual; remote work fine.  Is this you?  Let me know and I can put you in touch. Feel free to share with your geek network.  ",
        "Likes": 22,
        "Shares": 6,
        "Number of Comments": 1
    },
    {
        "idx": 34,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7039971559079350273/",
        "Post Description": "As Ken Fordyce said, the best in the world attend this meeting. Come join us! #businessanalytics #informs",
        "Likes": 2,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "INFORMS",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7039630834735149056/",
            "Original Post Description": "2023 INFORMS Business Analytics Conference 🌐https://lnkd.in/eFtgXMWY\n📆  April 16-18, 2023 📍 Aurora, CO\nJoin leading #analytics professionals and industry experts in discovering new mathematical solutions to problems, networking strategies for advancing your career, and recognizing individual and team efforts within your field with most prestigious awards in analytics and operations research.\n#datascience #ML #AL #orms #INFORMS #defense #healthcare #marketing #retail #cyber #supplychain #businessanalytics #2023Analytics \n",
            "Original Likes": 31,
            "Original Shares": 5,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 35,
        "User": "INFORMS",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7039240871245971457/",
        "Post Description": "#EmbraceEquity with INFORMS on this International Women's Day with a personal hero story from Polly Mitchell-Guthrie in which she also shares her ABCs for women in the workplace.[OR/MS Today] https://bit.ly/3ZKMi6m\n\n#INFORMS #embraceequity #IWD2023 #womeninstem",
        "Likes": 41,
        "Shares": 2,
        "Number of Comments": 3
    },
    {
        "idx": 36,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7038890067616022528/",
        "Post Description": "Monetizing your own data! Do you see more applications in cutting costs, expanding revenue, or in something completely different such as renting your data out?\n\nWhat are your favorite case studies or companies doing this?\n\n#monetization #data #casestudy #analytics",
        "Likes": 2,
        "Shares": 0,
        "Number of Comments": 1
    },
    {
        "idx": 37,
        "User": "INFORMS",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7038515980683104257/",
        "Post Description": "2023 INFORMS Business Analytics Conference 🌐https://lnkd.in/egDBRhzb\n📆  April 16-18, 2023 📍 Aurora, CO\nJoin leading #analytics professionals and industry experts in discovering new mathematical solutions to problems, networking strategies for advancing your career, and recognizing individual and team efforts within your field with most prestigious awards in analytics and operations research.\n#datascience #ML #AL #orms #INFORMS #defense #healthcare #marketing #retail #cyber #supplychain #businessanalytics #2023Analytics \n",
        "Likes": 37,
        "Shares": 4,
        "Number of Comments": 1
    },
    {
        "idx": 38,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7037264484163362817/",
        "Post Description": "Win-win-win!  Congrats Sébastien Martin and Lyft team on a great algorithm (and a great paper.)  Joyce Weiner and Tulia Plumettaz and I are cheering for you all the way as we serve as your coaches on the #franzedelmanaward #analytics #lyft #operationsresearch.   Beep, beep indeed! ",
        "Likes": 5,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Sébastien Martin",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7037102302092017665/",
            "Original Post Description": "I'm excited to share an article recently written about a project I did with the ridesharing company Lyft. If you used the Lyft app in the last year or so, anywhere in the US or Canada, the algorithm we wrote helped find the best available driver for your trip. Feel free to take a look if you want to understand what happens behind the curtain when you request a ride!\n\nWe used online reinforcement learning to learn how to better match drivers to passengers in real-time and constantly improve, a first for ridesharing companies.\n\nThe project was challenging, as it took over a year to make the algorithm work and obtain the required buy-in from across the company. However, the results were well worth the effort and benefit everyone: passengers are happier (more 5-star reviews and a 13 percent decrease of situations where no driver is available to pick up a customer), drivers are busier, and the new algorithm generated over $30 million a year in increased revenue.\n\nThe project is currently a finalist in the INFORMS Franz Edelman award, thanks to the effort of Lyft’s incredible team:\n\nXabier AZAGIRRE, Nicholas Chamandy, Benjamin Han, Vijay Narasiman, Zhiwei (Tony) Qin, Akshay Balwally, Guillaume Candeli, Alona King, Hyungjun Lee, Martin Loncaric, Baptiste Richard, Sara Smoot, Sean Taylor, Garrett van Ryzin, Di Wu, Alex Zamoshchin",
            "Original Likes": 174,
            "Original Shares": 8,
            "Original Number of Comments": 10
        }
    },
    {
        "idx": 39,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7035992735962578944/",
        "Post Description": "Super proud of Jyothika Mohan Yifan CAI Shiyi (Ashley) Yue Anchal Chaudhary Akash Puthalath and Yuwen Ma for their great work in our practicum project. \n\nThank you Jerry Abiog , David Edmonson and especially Bruce La Fetra, The Client Whisperer for being links in our chain of success.\n\n#got_ucdavis_msba?",
        "Likes": 15,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Jerry Abiog",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7034637461704114176/",
            "Original Post Description": "I had the pleasure of chatting with these Masters of Business Analytics students from the University of California, Davis  Akash Puthalath Jyothika Mohan Yifan CAI, and learning about their journey in the world of #AI\n\nThe future is bright with this group!\n\nThanks, David Edmonson and Liam Heery, for the introduction.\n\n#future #students #university #businessanalytics #artificialintelligence ",
            "Original Likes": 26,
            "Original Shares": 5,
            "Original Number of Comments": 2
        }
    },
    {
        "idx": 40,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7035990479338958848/",
        "Post Description": "#supplychain #analytics and #fashion - who could want anything more? #got_ucdavis_msba students have been invited. Hope everybody else can make it as well. ",
        "Likes": 9,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Evo, a ToolsGroup company",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7030928748937900036/",
            "Original Post Description": "Are you prepared for tomorrow's fashion merchandising challenges? Join us on Feb 28th to discover how fashion forecasting science can help you compete in an increasingly challenging fashion market! \n\n#ai #fashionindustry #supplychain #fashion ",
            "Original Likes": 9,
            "Original Shares": 8,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 41,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7034904119425343488/",
        "Post Description": "Got quality software? Brian Gallagher, PhD, PMP, CISA wants to know. The Watts S. Humphrey Software Quality Award  recognizes outstanding achievements in software quality.\n\n(Got buggy software? You’re not alone. Ping me and I’m happy to help connect you with somebody who might be able to fix it.)\n\n #software #quality",
        "Likes": 2,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Brian Gallagher, PhD, PMP, CISA",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7034617058134822912/",
            "Original Post Description": "I'm honored again to serve on the selection committee for the Watts Humphrey Software Quality Award. Please consider nominating individuals or teams for the award which recognizes outstanding achievements in improving an organization's ability to create and evolve high-quality software-dependent systems.",
            "Original Likes": 34,
            "Original Shares": 2,
            "Original Number of Comments": 5
        }
    },
    {
        "idx": 42,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7033812822857814016/",
        "Post Description": "🎯 Project management for analytics projects! What books or articles do you recommend?  \n\nI am looking specifically for suggestions in the Analytics project management domain – not so much actual/agile software development, and we already have the PMBOK.  \n\nWant “how to manage an Analytics project in the wild?”  \n\nDouble bonus points if you’re a practitioner Ken Scales Irv Lustig  Gregory Kiefer Aaron Burciaga, CAP, ACE  Harrison Schramm  and of course a big gold star if you shine inside the classroom Matthew A. Lanham Sanjay Saigal  Pelin Pekgun .\n\n #analytics #projectmanagement",
        "Likes": 2,
        "Shares": 0,
        "Number of Comments": 5
    },
    {
        "idx": 43,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7031762778872836096/",
        "Post Description": "👗 Well-dressed Wednesday favor request - student team seeking informational interviews at #Tobi, #Nastygal, #Everlane, #Modcloth, or #Pinkblushmaternity. Students are working on developing a B2B Shopify app for a women’s fashion company. As part of their research, they are interested in conversing with clothing retailers regarding #inventorymanagement, #demandforecasting, #customeranalysis, online fashion shopping using #Shopify stores, and the relevance of using #AI/ML for giving personalized recommendations to customers. Feel free to forward across to your community. Any help is appreciated! #got_ucdavis_msba #fiveminutefavor",
        "Likes": 13,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 44,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7030919056744452096/",
        "Post Description": "Kiefer Consulting is hiring! These are great people to work for. In addition to great cutting edge technology, your coworkers will be awesome. #hiring #analytics",
        "Likes": 5,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Gregory Kiefer",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7029563402524008448/",
            "Original Post Description": "Do you love data? Do you like to build visualizations? Do you have experience with Power BI? Do you have a degree in technology?  Do you have any experience working with government?  Do you want to join a great team of people at a great company that are passionate about data?  Come join our team at Kiefer Consulting.  Please send your resume to resumes@kieferconsulting.com   We are hiring.   #powerbi #jobs #hiring #microsoft ",
            "Original Likes": 19,
            "Original Shares": 1,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 45,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7029843249305423872/",
        "Post Description": "Boosting the signal: are you looking for a job as a #fullstack #softwareengineer, but also deeply care about children’s learning? Are you #opentowork with fantastic people? Look no further: Kyron Learning is your place. Click below and say hi to Pavel Sirotin for me.",
        "Likes": 2,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Pavel Sirotin",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7029637287042838528/",
            "Original Post Description": "Kyron Learning is hiring. Let's improve access to education together. \n\n#hiring #education #learning ",
            "Original Likes": 28,
            "Original Shares": 5,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 46,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7029469004096311298/",
        "Post Description": "Hot off the INFORMS presses: the latest Resoundingly Human episode features Walt DeGrange of CANA to take a look behind the scenes at the role of analytics in football as we countdown to the 2023 Super Bowl! #analytics #football #informs \n\nEven if you skew towards Fibonacci and away from football, this will have you cheering.",
        "Likes": 14,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 47,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7028756127135789056/",
        "Post Description": "#industrialengineering and Doug Meiser - such a fun combination! I so enjoyed coaching Doug and his team at Kroger when they competed in the #edelman  a while back. He’s only gotten better. Flagging #students and #jobseekers including #dataanalytics (which is, after all, sometimes only about three inches away from industrial engineering…)",
        "Likes": 1,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Doug Meiser",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7027643087862599680/",
            "Original Post Description": "Know anyone who might be interested?\n\nIt is going to be fun here for a while.  ",
            "Original Likes": 41,
            "Original Shares": 17,
            "Original Number of Comments": 3
        }
    },
    {
        "idx": 48,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7026925908057874432/",
        "Post Description": "Does the 35% project success rate seem high or low to you? #machinelearning  #projectmanagement  #oops \n\nThank you Neelam Hussain-Mills  for raising the issue!",
        "Likes": 3,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Neelam Hussain-Mills",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7026909606278754304/",
            "Original Post Description": "Only 35% of projects today are completed successfully. This is about to change! Researchers, startups, and innovating organizations, are beginning to apply AI, machine learning, and other advanced technologies to project management, and by 2030 the field will undergo major shifts.\n\nAntonia Nieto - Rodriguez at HBR shows how organizations that want to reap the benefits of project management technologies should begin today by gathering and cleaning project data, preparing their people, and dedicating the resources necessary to drive this transformation. #people #machinelearning #change ",
            "Original Likes": 1,
            "Original Shares": 1,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 49,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7022642523256885248/",
        "Post Description": "Boosting the signal! MSBA Executive Director and Associate Director for Admissions and Career Development. In addition to all the great things mentioned by Amy Russell , you would also get to work with Shachi Govil, John Carter, Ph.D. , and me!",
        "Likes": 3,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Amy Russell",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7022607843077885952/",
            "Original Post Description": "If you know anyone seeking a highly rewarding, mission-motivated role where you get to work with lots of amazing students and a dynamic team, I'm #hiring. \n\nThese roles are highly stable, and the program is thriving - #1 in the world for 10 year ROI.\n\nThese positions are also matches not only for those with higher ed experience, but also those with #recruiting experience seeking to transition to industry, or potential STEM educators depending on the role. \n\nMSBA Executive Director: this would be my replacement and would report to me. Apply by Tuesday to be in the first review: \n\nNew headcount: Associate Director for Admissions and Career Development: apply ASAP no later than Jan 31. \n\nDetails available at: https://lnkd.in/gZAi5Jpi\n\n#hiringnow #highered #recruiterjobs",
            "Original Likes": 81,
            "Original Shares": 16,
            "Original Number of Comments": 1
        }
    },
    {
        "idx": 50,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7021327947856826368/",
        "Post Description": "Beep beep! 🚗 \n\nHonored to be coaching the team from Lyft in this year’s Edelman competition with Joyce Weiner  and Tulia Plumettaz .  #INFORMS #reinforcementlearning  #30million #Lyft #datastorytelling",
        "Likes": 47,
        "Shares": 4,
        "Number of Comments": 0
    },
    {
        "idx": 51,
        "User": "Amy Russell",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7009560548304396290/",
        "Post Description": "We're hiring for UC Davis MSBA. Amazing team, program ranked #1 for 10-year ROI, impactful work, and high stability. Hybrid role with time in SF - seeking someone with ability to interview candidates for analytics program, then guide students in analytics career development. Great role for recruiters looking to make a transition, STEM teachers, and more. If you have the foundation and are mission motivated, we can train the rest. Apply by Monday to be considered for initial round review. We move to rolling review after: https://bit.ly/UCDMSBAOpp #hiring #higheredjobs #analyticsjobs #recruitingnow ",
        "Likes": 83,
        "Shares": 2,
        "Number of Comments": 1
    },
    {
        "idx": 52,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7014350515115319296/",
        "Post Description": "EdTech!  Does anybody work in (or have contacts in) any of the following companies?  I have an MSBA student who would like to do informational interviews.  Seeking Coursera, Udemy, Udacity,  PowerSchool/Schoology, Savvas, Chegg Inc., Masterclass, Blackboard, SeeSaw Learning.  Feel free to forward.\n\n#got_ucdavis_msba #edtech #interview",
        "Likes": 16,
        "Shares": 0,
        "Number of Comments": 3
    },
    {
        "idx": 53,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7013260618774319104/",
        "Post Description": "#datascientists #informs \nElena Gerstmann, PhD, FASAE, CAE   - I have been a member of INFORMS for more than 20 years, each of them better than the last. Strongly encourage data scientists to join today! \n\nBecause…networks. What else could you need to close the year out optimally?",
        "Likes": 14,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Michael Watson",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7009601661690142720/",
            "Original Post Description": "I have a new post on five things I've added to my network design talk.  I really liked the classic material in the talk, but it was time to enhance it.   \n\nHere are the five:\n1. Gurobi Optimization's Burrito Game\n2. Hidden Objectives (multi-objective and hierarchal optimization)\n3. More on risk, including Jeff Camm's idea the hard work of scenario generation.\n4. Value in the just the model building\n5. Darin Buelow's write-up of the site selection for Micron's new fab plant.\n\nHere's the link to the full article:\nhttps://lnkd.in/gFSgwcVT\n\n#optimization #supplychainstrategy ",
            "Original Likes": 191,
            "Original Shares": 2,
            "Original Number of Comments": 18
        }
    },
    {
        "idx": 54,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7011116930682040320/",
        "Post Description": "Product requirements document for B2B Shopify app/store!  Have you read (or written) a product requirements document for an app for Shopify?  I have a student team researching a PRD for a B2B app they want to get mounted on Shopify.  Would you be willing to offer 20 minutes of your time to speak with them?  If so please message me.  Much appreciated.  \n\nFeel free to forward to any product requirement document gurus you know, esp if they are Shopify gurus as well.",
        "Likes": 19,
        "Shares": 1,
        "Number of Comments": 5
    },
    {
        "idx": 55,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:7009648006249529345/",
        "Post Description": "Got Psych?  \n\nA consumer research associate is looking for a professional psychologist interested in consulting on a research project. The researcher’s client is a production homebuilder looking to understand the psychology of why buyers are cancelling their purchase contracts, and why people interested are delaying their purchase intents. Referrals should go to Maureen Ladley at maureen@ladleyandassociates.com by Tuesday, December 20th.\n\nPlease tell Maureen that I sent you if you respond :)",
        "Likes": 11,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 56,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6990691223132938241/",
        "Post Description": "https://lnkd.in/gxWpp6QM #informs2022 #FreestyleORSupreme #sassoftware",
        "Likes": 8,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 57,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6985970619737661440/",
        "Post Description": "Have you added any events to your 2022 Annual Meeting experience? The Freestyle O.R. Supreme Expo is a fast-moving live game show, in which students and early-career professionals frame a problem and present an overview of a solution in real-time. [Register] https://bit.ly/3CIJI8s\n\nFreestyle O.R. Supreme Exposition | October 19 at the 2022 INFORMS Annual Meeting 9:15-11:15am\n\n#informs #students #70s",
        "Likes": 28,
        "Shares": 2,
        "Number of Comments": 0
    },
    {
        "idx": 58,
        "User": "Nathan Holmes-King",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6983902550097887232/",
        "Post Description": "Starting in January 2023, I will have a six-month gap in between when I graduate with a B.S. in data science and when I start the M.S. in data science program. During those six months, I would like to live and work in Iceland in data science. I believe that, having received education and work experience in Silicon Valley, I would be very valuable to any Icelandic company that wanted to hire me. Does anyone have any opportunities that would fit me?\n\nI have already tried applying to positions and emailing companies directly, and that hasn't worked yet.",
        "Likes": 3,
        "Shares": 1,
        "Number of Comments": 1
    },
    {
        "idx": 59,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6974177312963522560/",
        "Post Description": "The INFORMS Practice Section is sponsoring a Webinar Series entitled: “Sustaining Outstanding Analytics Organizations.” \n\nOur next guest speaker is Margret Vilborg Bjarnadottir, Associate Professor of Management Science and Statistics at the University of Maryland, Robert H. Smith School of Business, and a very active member of INFORMS.\n\nHer topic is: Addressing Pay Inequity: The Building of an Analytics Startup\n\nPlease mark your calendars for September 16, 2022 at Noon Eastern Time and feel free to share this with professional contacts who might be interested.\n\nFor complete details and to REGISTER for this event, please visit: https://lnkd.in/gEb53ssX",
        "Likes": 18,
        "Shares": 2,
        "Number of Comments": 0
    },
    {
        "idx": 60,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6955888218798010368/",
        "Post Description": "Concerned about uncertainty in the economy and how your business might perform?  Check out Karl Pontau's workshop for how to steer through the turbulence.",
        "Likes": 0,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Squash and Stretch Productions",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6940655796674326528/",
            "Original Post Description": "With the economy showing signs of a recession, it's more important than ever to make sure your marketing is able to bring in the clients you need to thrive (not just survive) through the downturn.\n\nIt's stressful trying to grow a business, even more so these past few years. \n\nHow would you feel if you didn't have to fret about your marketing?\n\nJoin 🧠Karl Pontau, The Story Maker as he shows you how to optimize your marketing messaging so your business stands out, grabs people's attention, and inspires them to buy; all without spamming or gimmicky tactics that end up hurting your brand.\n\n#startup #smb #marketing #recessionproof #storytellingcoach",
            "Original Likes": 4,
            "Original Shares": 10,
            "Original Number of Comments": 3
        }
    },
    {
        "idx": 61,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6943201669513953280/",
        "Post Description": "Want to make sure your marketing holds up in a recession? Come see Karl Pontau of Squash and Stretch Productions tell you how!",
        "Likes": 4,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Squash and Stretch Productions",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6940655796674326528/",
            "Original Post Description": "With the economy showing signs of a recession, it's more important than ever to make sure your marketing is able to bring in the clients you need to thrive (not just survive) through the downturn.\n\nIt's stressful trying to grow a business, even more so these past few years. \n\nHow would you feel if you didn't have to fret about your marketing?\n\nJoin 🧠Karl Pontau, The Story Maker as he shows you how to optimize your marketing messaging so your business stands out, grabs people's attention, and inspires them to buy; all without spamming or gimmicky tactics that end up hurting your brand.\n\n#startup #smb #marketing #recessionproof #storytellingcoach",
            "Original Likes": 4,
            "Original Shares": 10,
            "Original Number of Comments": 3
        }
    },
    {
        "idx": 62,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6933060108595712000/",
        "Post Description": "The Great Resignation is real - here's how to win and keep the right talent.  If you are an employer struggling, consider attending Karl Pontau's workshop!",
        "Likes": 4,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Karl Pontau",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6932381980135194624/",
            "Original Post Description": "Looking for relief from your hiring and employee retention challenges?\n\nCheck out this interactive workshop I'm hosting next week!\n#employeeretention #greatresignation #greatreshuffle #hiringchallenges #smallbusiness",
            "Original Likes": 2,
            "Original Shares": 3,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 63,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6922912088352849921/",
        "Post Description": "Negotiation is an important part of everybody's business!  Thank you Alice Shikina for this presentation.",
        "Likes": 2,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Alice Shikina",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6922620790387462144/",
            "Original Post Description": "You negotiate almost EVERY single day.\n\nYou negotiate in relationships, friendships, at work, at home, with strangers, and sometimes even while driving!\n\nBecause of this, you need to have an understanding of what is non-negotiable and what is. You need to be prepared for objections to your proposals to respond with empathy and tact.\n\nWant to know how to do this? Well, you're in luck!\n\nI want to give a special thanks to Russ Catanach and Greg Louie for having me on the DIY for Business Podcast.\n\nIn this episode, I discuss the above to help you accelerate your negotiation journey and be more persuasive as an executive, manager, employee, spouse, and much more!\n\n#negotiationtraining #managementskills #conflictmanagement",
            "Original Likes": 25,
            "Original Shares": 4,
            "Original Number of Comments": 4
        }
    },
    {
        "idx": 64,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6912114566541774849/",
        "Post Description": "Hi all - would you take 5 minutes and do me the favor of filling out the words that describe your job titles?",
        "Likes": 0,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Samuel Lee",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6911741764563337216/",
            "Original Post Description": "My 5-minute favor request for the week.\n\nWould you list all the titles people have for your job.  Would you post them in comments on this post?  \n\nExample if I were to post I would write: \nMLO, Mortgage Loan Officer, Loan Officer, Mortgage Lender, Mortgage Broker, Mortgage Banker, Lender\n\nI ask you spend no more than 5 minutes to write that about yourself for me in a comment.  Simple as this is it would *greatly* assist me.\n\nThank you in advance!\n\nMichael Balistreri Daniel Beck, CFA David Bellumori Joshua Borger Janet Brewer Rick Brounstein Robin Brown Lisa C. Bryant Morris Chubb Adam Ferguson Matthew Cahill Craig Daniel Joe Delaney RLP®, MBA Stephen Dobrow Steven Haley Lydia Hsu George Lawyer Anita Koumriqian Jen Lee Richard Monetta Noe Munoz Jaime Orendac, SPHR-CA, SHRM-SCP Jason Papier Annie Paul Judy Pearce Glenn Perkins Doris Pickering Duleep Pillai Kristie Prinz Mario Ramirez Ruben Ruiz, Esq. Alice Shikina Clifford Stephan Brit Summerill Xiomara Vielman Richard Wang Carter Welch Nicolay Wiborg Jeffrey R. Windsor",
            "Original Likes": 12,
            "Original Shares": 2,
            "Original Number of Comments": 101
        }
    },
    {
        "idx": 65,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6905651623515844608/",
        "Post Description": "Business networking survey question - can you help by filling this out?",
        "Likes": 0,
        "Shares": 0,
        "Number of Comments": 1,
        "Repost": {
            "Original User": "Samuel Lee",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6901234705803431936/",
            "Original Post Description": "Please do me a favor and complete this survey. 🙂\n\nYou have a new referral you could send to Alpha or Beta.  What would you do?\n\nHypothetical assumptions...\n> 3 people - You, Alpha, and Beta\n> Alpha and Beta solve the same problem for pay\n> You believe you can trust each to do a good job\n> You believe each could refer you an IDEAL client.\n> Your network equally vouches for Alpha and Beta\n\n> All the acts you have taken\n1. You made 3 referrals in the last 12 months to Alpha that closed and were IDEAL for them.\n\n> All the acts Alpha has taken \n2. Alpha solved the problems you referred efficiently, at the cost quoted, in the time quoted, and to the satisfaction of the problem haver you referred.\n3. Alpha thanked you in a phone call when each referral closed\n4. Every time you encounter Alpha they are friendly.\n\n> All the acts Beta has taken\n5. Every time you encounter Beta they are friendly.\n\nThere are no other acts that anyone has taken.",
            "Original Likes": 2,
            "Original Shares": 4,
            "Original Number of Comments": 12
        }
    },
    {
        "idx": 66,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6891185787304574976/",
        "Post Description": "Seeking a favor - a former intern of mine is interested in working for self-driving car companies, such as Waymo or Cruise.  Does anybody have any connections who might be willing to spend a few minutes with him conducting an informational interview?  He's going to graduate in December 2022 with an undergrad degree in data science, so of course he can count and he can code :)",
        "Likes": 8,
        "Shares": 1,
        "Number of Comments": 0
    },
    {
        "idx": 67,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6858768622140170242/",
        "Post Description": "No posts",
        "Likes": 5,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "University of Arkansas M.S. in Operations Management",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6856986764054200320/",
            "Original Post Description": "Did you know graduate certificates can help boost your resume, increase your salary and make you more marketable as a candidate? Check out our programs! https://lnkd.in/eDwzUv5H \n#professionaldevelopment #onlinelearning #gradschool #certificateprogram #projectmanagement #leansixsigma #homelandsecurity",
            "Original Likes": 2,
            "Original Shares": 3,
            "Original Number of Comments": 0
        }
    },
    {
        "idx": 68,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6793982247868481536/",
        "Post Description": "TL;DR - submit to the Wagner Prize by May 2\n\nThe Daniel H. Wagner Prize for Excellence in the Practice of Advanced Analytics and Operations Research is awarded to author or authors of a work that best exemplifies excellence in writing, clarity in presentation, innovation in analysis, and practical success.\n\nThis prize emphasizes the quality and coherence of the analysis used in practice and honors the memory of the late Dr. Daniel H. Wagner, a member of ORSA, then INFORMS for more than forty years. Dr. Wagner strove for strong mathematics applied to practical problems, supported by clear and intelligible writing. This prize recognizes those principles by emphasizing good writing, clear presentations, strong analytical content, and verifiable practice successes over quantitative benefits. Submission Deadline is May 2, 2021.\n\nFor complete details please visit:  https://lnkd.in/gv4iBJZ \n",
        "Likes": 4,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 69,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6707827693049782272/",
        "Post Description": "Do you have an outstanding #orms or #analytics project? The 2021 Edelman Competition is accepting applications through October 21, 2020. To learn more visit: https://lnkd.in/gTWJFBg\n",
        "Likes": 16,
        "Shares": 1,
        "Number of Comments": 1
    },
    {
        "idx": 70,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6686081092837081088/",
        "Post Description": "Want to know more about the Lean Six Sigma Graduate Certificate? The four courses in this certificate follow the IASSC body of knowledge and prepare students to sit for the Green Belt certification exam. Register today!\n\nhttps://lnkd.in/gcrmgzk\n \nThis is offered by the University of Arkansas, where you can complete a master's degree fully online, from the comfort of your own couch, in full Razorback garb.  Dip your toe into this certificate and stay for the whole degree!  ",
        "Likes": 11,
        "Shares": 1,
        "Number of Comments": 0
    },
    {
        "idx": 71,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6673381732781318144/",
        "Post Description": "Join Anna Nagurney of UMass Amherst for her \"Blood, Sweat, and PPEs: Rescuing Perishable Product Supply Chains and Impacting Policy through Analytics\" webinar next Friday, June 12, at 12noon! In this webinar, Dr. Nagurney will discuss how the pandemic is affecting perishable product supply chains and how analytics can be used to determine the steps for recovery. Click to view more details and register: https://bit.ly/3gGtsYp #supplychainmanagement ",
        "Likes": 5,
        "Shares": 0,
        "Number of Comments": 1
    },
    {
        "idx": 72,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6612426599721766912/",
        "Post Description": "Drone time!  Click below to see what the University of Arkansas can do for you here.",
        "Likes": 4,
        "Shares": 0,
        "Number of Comments": 0,
        "Repost": {
            "Original User": "Nicole Harris Zimmerman",
            "Original Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6612368498297569280/",
            "Original Post Description": "Are you interested in a career with drones? U of A Professional and Workforce Development has a class on January 16th. For more information go to https://training.uark.edu/ #uofa #professionaldevelopment #workforcedevelopment #drones #dronepilottraining #careers \nMark B. Tara Dryer, Ed.D., PMP Cheryl Murphy Heather Sprandel Kay Murphy Caroline Chandler Shannon Siebler Erin Dickey R. Aileen George Leonard Ridley Ham Richard",
            "Original Likes": 3,
            "Original Shares": 3,
            "Original Number of Comments": 1
        }
    },
    {
        "idx": 73,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6577587887775322114/",
        "Post Description": "Are you this good?  From your friends at INFORMS (of whom I am one):\n\n\"The Franz Edelman Award recognizes and rewards outstanding example of operations research, management science, and advanced analytics.   Everyone loves to win, especially when it’s at something you love. For this top analytics competition, think of a recent project that you have completed; think of the impact; think of the money, time, or lives saved. Shouldn’t you share that with the world? The Edelman Competition showcases the six best advanced analytics and operations research projects of the year— this could be your year to win!\"\n\nhttps://lnkd.in/g72dVtp\n\nYou know you want it.  #analytics\n",
        "Likes": 8,
        "Shares": 0,
        "Number of Comments": 1
    },
    {
        "idx": 74,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6539902821326745600/",
        "Post Description": "Ever wondered what it's like to coach a winning Edelman team?  Here's what it was like for me:\n\nhttps://lnkd.in/eMQ7b7e #edelman #informs",
        "Likes": 25,
        "Shares": 0,
        "Number of Comments": 3
    },
    {
        "idx": 75,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6422931465578913792/",
        "Post Description": "You're invited!  \n\nDr. Ann Steiner's Book Launch this Saturday at Book Passages Corte Madera (California)\n\n \nIf you are in town this Saturday, you are invited to help celebrate the launch of my book Help Your Group Thrive: A Workbook and Planning Guide, published by Routledge Books, London.\n \n\nWhere: Book Passage in Corte Madera\nAddress: 51 Tamal Vista Blvd, Corte Madera, CA\nWhen:July 14th from 7-9 pm ...Bastille Day!\n \n\nHelp Your Group Thrive: A Workbook and Planning Guideis for leaders of work groups, coaches, managers, book and service clubs. Leaders of community organizations, self-help groups, writer’s and critique groups, and students of the social sciences, will find it a valuable resource. As with my popular book for therapists, this workbook and planning guide includes an overview of different kinds of groups, leadership strategies, tips for dealing with common group challenges, numerous modifiable forms and more.\n \n\n* Please forward this invitation to friends, family, colleagues and others who may be interested.*\n \n\nFYI: The book seller will have the books for sale. They are also available from Amazon or the publisher, Routledge: 20% Discount Code: FLR 40\nhttps://lnkd.in/gcsPDUm   ",
        "Likes": 4,
        "Shares": 0,
        "Number of Comments": 1
    },
    {
        "idx": 76,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6240211542575579136/",
        "Post Description": "All righty folks, it's the ultimate Geek Contest.  Was AP Calculus in high school just a tasty little warmup?  Are you surrounded by analytics PhDs, and yet you still want more?  Do you have a nearly intractable math problem and want recognition for your good work in solving it?  If yes, the Daniel H. Wagner Prize wants to hear from you.   Deadline for 2-page abstract is May 1, 2017.",
        "Likes": 1,
        "Shares": 0,
        "Number of Comments": 0
    },
    {
        "idx": 77,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6222195932700778496/",
        "Post Description": "Are you nurturing the right 2%?  Dave Dotzler and I show you where to find them:  https://lnkd.in/gnGMY35 ",
        "Likes": 12,
        "Shares": 0,
        "Number of Comments": 1
    },
    {
        "idx": 78,
        "User": "Carrie Beam, Ph.D.",
        "Link to Post": "https://www.linkedin.com/feed/update/urn:li:activity:6179063777879666688/",
        "Post Description": "Come study with a winner!  UMUC's MS in Data Analytics program  is the proud recipient of two MidAtlantic UPCEA awards:\n- 2016 UPCEA Mid-Atlantic Region Outstanding Program Award \n- 2016 UPCEA Mid-Atlantic Region Partnership Award (MSDA program partnership with IBM)\n\nIf you want to come learn with us, you can take a data visualization class from me (it includes SQL and Python and Tableau).  UMUC runs online 24/7, so we teach where and when you want to learn.  ",
        "Likes": 11,
        "Shares": 0,
        "Number of Comments": 4
    }
]