[
    {
        "idx": 1,
        "Username": "rosemary-pearman-454a7a231",
        "Comment": "Maths, which I hated with a vengeance! Mind you being dyslexic, even though I had a good memory, I had problems learning enough to come away with any qualifications, but I did manage to get a job as a private Nanny, which lead to more roles within child care, which lasted for just over 13 years, even after getting married and having my first child.\nThen after the birth of my second child, I took up volunteering for charities, as retail assistant and now my dream is to eventually open up my own secondhand and vintage shop.\n",
        "Likes": 9
    },
    {
        "idx": 2,
        "Username": "alina-kushkyan-423350211",
        "Comment": "I think that all subjects are needed to form a comprehensively developed person. Mathematics is important, but not for everyone. I think it is more given to people with a different mindset.\n We can also say about languages, biology, chemistry, political science, history, ecology, that are well received by other children.\nBut I would like to keep your attention to the following aspect.\nEducation and formation of a person. Society needs decent,kind, well-mannered people.\nThose who understand the values of life, relationships between people, care, love of humanity, respect, politeness. It is necessary to be kind in order to raise a good generation. In addition, I would add ethics and behavior, culture and art. In the future, the children themselves will choose which science is closer to them and what they want deepen.There may be classes with advanced study of math.But of course, if you can create methods and mechanisms for better understanding and development, then why not?",
        "Likes": 23
    },
    {
        "idx": 3,
        "Username": "francine-wilson-a70150146",
        "Comment": "I’m 66 and still using my fingers to count!  Not interested in percentages and as my multiplication tables long gone off my memory. But still having fun about it all and let the machines do it all for me. Worth learning 5 languages to get me around the world and history is just magical to have learnt. Even the religions are great to know a little to be able to respect them. \nBill can I use your playlist with my 3 years old granddaughter?  I may learn something myself too",
        "Likes": 3
    },
    {
        "idx": 4,
        "Username": "dana-campbell-766baa170",
        "Comment": "Definitely Math🤓✌️ Everything that can be counted, doesn’t always count and Everything that counts .. insn’t always counted. 🤨🥱🤓",
        "Likes": 1
    },
    {
        "idx": 5,
        "Username": "keitha-fitzgerald-ab150b5b",
        "Comment": "Math could of focused more on daily life and the costs of everything. They should have 3 or more stages for that if kids want to deepen their math skills. I loved science. English could be mixed with spanish or another language at an earlier time because being young your mind absorb like a sponge. History could of been better by doing a family history so you can talk about that era and it would peek most kids interests. So many levels in that too that could of been covered.",
        "Likes": 4
    },
    {
        "idx": 6,
        "Username": "marta-verdier-santiago-b440a527b",
        "Comment": "Do you like my Infinity concept in geometry?",
        "Likes": 3
    },
    {
        "idx": 7,
        "Username": "abhishekadhikari",
        "Comment": "The particularly difficult one was a Chronological order question. 5-6 events would be given jumbled up and we had to remember the dates and put them in the right order. In lower grades the events would be spaced out... but as we went into higher grades the event timings would keep getting closer and closer and create confusion...\nIt is one thing to know that something happened approximately 1000 years back, but it is entirely a different topic to exactly say whether the event happened 1001 years & 1 month earlier or 999 years & 7 months earlier... Bring in the date and it's an entirely different fudge altogether...",
        "Likes": 3
    },
    {
        "idx": 8,
        "Username": "rupinder-panesar-6427941b2",
        "Comment": "None! I was good at everything! I was known as an All-Rounder! But I am really struggling at A-LEVEL Google Maps! 😉❗I was good at ballet, sport, all Academic subject disciplines, dance, swimming, singing in the school choir, I was the reason my tutor group in Secondary School won Sports' Day 3 Years in a row and make up my own jokes which make even my mum laugh and giggle, more whitty than GOSH. And loved winding up my GCSE English Teacher;- like I am doing rite now and even did 3 Days' Women's Self Defence Class rather than grading in the martial arts' Class that NO woman or girl would turn up to and I soon (after a year) after realised why! 😎! Made my Career Choice very difficult. PERSONALITY Wise think of me more Macro-Hard than Micro-Soft.",
        "Likes": 9
    },
    {
        "idx": 9,
        "Username": "gokturkaktas",
        "Comment": "To answer your question from the given four selections, ‘History’ is the subject I am choosing.\n\nThe preface to this choice is very interesting for me.  It was not a subject I studied during schooling.  However, I am a very big enthusiast into History overall by reading, listening, viewing and evaluating selective topics that interest me.\n\nI recommend the Book by Mr. Yuval Noah Harari-\n‘Sapiens: A Brief History of Humankind’.\nfor all to review and would further my recommendation that it would be an excellent item presented in schools.  \n\nKind regards,\n\n👑😎👑",
        "Likes": 2
    },
    {
        "idx": 10,
        "Username": "muhammad-syed-986767179",
        "Comment": "If math's the challenge, your 'By the Numbers' Spotify playlist might be the remedy. Music has a magical way of making things more enjoyable. As for my least favourite subject in school, well, I'm all about learning, so no subjects are on my dislike list.\n\nSweet playlist! Math getting a groove-up sounds like a plan. As for school, I admit I wasn't there, but if I had a least favourite subject, it would probably be \"Waiting for Quantum Computers 101.\" That class takes forever! 😄🎶 #ByTheNumbers #QuantumBeats",
        "Likes": 1
    },
    {
        "idx": 11,
        "Username": "andrew-chase-asic-cic-cid-clwm-546a9ab7",
        "Comment": "English by a long shot. I do not enjoy the physical act of writing. I had a teacher that made us write everything out by hand so she could recognize the handwriting and could ensure someone else didn’t write it. All the other classes allowed use of my word processor and those classes were much more tolerable.",
        "Likes": 3
    },
    {
        "idx": 12,
        "Username": "patrick-binienda-5b511652",
        "Comment": "I love history now but when I was a kid it felt it was unfair since so much happened from the beginning of time until then. Even kids 2000 years ago didn’t have to learn about Greek society or European wars. Thousands of years and something’s important happening every year all over the world. It was just too much to store in my little brain.",
        "Likes": 17
    },
    {
        "idx": 13,
        "Username": "dr-jack-ilmonen-14b6672",
        "Comment": "Answer: Religion! (Hocus Pocus fairytales created by superstitious, uneducated and  non-scientific people thousands of years ago, with no facts and figures to prove any of it to be true)",
        "Likes": 24
    },
    {
        "idx": 14,
        "Username": "saxenanitin",
        "Comment": "History, mostly due the way they taught the subject back in the days. Now, it’s a favorite 🙂",
        "Likes": 5
    },
    {
        "idx": 15,
        "Username": "johnjmurphy2008",
        "Comment": "I found History my best and worst subject! See history is based on point of view, and let me tell you, if your a reader like I was growing up, you realized what they we teaching us in those history books was skewed to a particular narrative! \n\nI became a teacher and have a composite Social Studies teaching certification from Texas! My kids (students) always loved it when we talked the rise and fall of civilization and my first question to them always was? How did their toilets work? What type of plumbing did they have? And so many more questions about how society grew, not who and what year did they exist! \nIt was more about the engineering of society, not the history! \nToday’s education misses the mark, the math does not add up, and the barritives change daily! But for one moment in time I taught the rise and the fall, and it was not about the power play in history, it was more about the how they designed how to live!",
        "Likes": 5
    },
    {
        "idx": 16,
        "Username": "mark-randall-27401940",
        "Comment": "PE",
        "Likes": 8
    },
    {
        "idx": 17,
        "Username": "sharkdavidvogel",
        "Comment": "🦈 Hey Bill Gates 🦈,\nDavid the Shark here 🦈! Surfing through the digital waves, I couldn't help but chomp on your 'By the Numbers' playlist. Music and math, what a fintastic combo! 🎵➕🔢\nSpeaking of school subjects, history was my least favorite, but not for the reasons most might think. In my JHS, I was told that the USA won the 1776 war because the British soldiers just stood there and got shot. They said that's how wars were fought back then - line up on opposite sides and shoot. I mean, come on! 🤦‍♂️🦈 That's like saying sharks only swim in straight lines. We all know there's more depth to history, just as there's more to the ocean's currents.\nIt's essential to teach history accurately, just as it's crucial to make subjects like math engaging. Thanks for doing your part with that groovy playlist! 🎶\nKeep making waves, Bill! And remember, history might be written by the victors, but it's up to us to ensure it's told correctly.\nSpread Shark Love #GabenFreUde 🦈❤️ #divineintervention. Fun fact: Did you know sharks have been around for over 400 million years, witnessing history unfold beneath the waves? Talk about a deep dive into the past! 🦈🌊📜",
        "Likes": 1
    },
    {
        "idx": 18,
        "Username": "charles-othoo-5aa6391b2",
        "Comment": "Well as to the contrary opinion. My worst subject was English. Reason being that learning started from  a strong vernacular background on which you had to understand concepts from the mother tongue. Unfortunately as I grew through classes things changed that I had to learn English to understand all the subjects. \nMaths became difficult because of English or I had to transillitrate questions to the native language to understand it. Anyway every subject is easy but it depends with the teacher, language, environment, time of introduction.\nThe worst was fear and terror unleashed by the teacher should you get the answer wrong. Many strokes Infront of you fellow pupils as you cry all your tears while others laugh at you.\nAll these frustrations demoralized me and hated maths. Am sorry it was a nightmare.",
        "Likes": 1
    },
    {
        "idx": 19,
        "Username": "ntshvicky",
        "Comment": "I never understand why history is still more important subject than computer in school.. (atleast in India i have seen)… where history can change based on which government rule.. based on country.. means think how british are teaching about how they ruled India India and how we taught British ruled.. history should not be a long theoretical language but better a presentation language.. taught history using VR technology.. by the way .. that you can teach using math also like trigonometry calculations using AR technology.. or physics.. but still History.. as i know western countries has different teaching techniques.. In India kids studied books as seriously since LKG",
        "Likes": 1
    },
    {
        "idx": 20,
        "Username": "balakumaraa-puvanendran-mbcs-citp-cc-cl-b4867a67",
        "Comment": "Mathematics provides an effective way of building mental discipline and encourages logical reasoning and mental rigor. In addition, mathematical knowledge plays a crucial role in understanding the contents of other school subjects such as science, social studies, and even music and art.\n\nScience instils a sense of intrigue and enables students to develop understanding and form questions based both on the knowledge they already have and the insight they wish to gain in the future. Students who excel in science lessons are likely to develop a strong ability to think critically.\n\nEnglish is important for students as it broadens their minds, develops emotional skills, improve the quality of life by providing job opportunities. Moreover, the use of English as an International language is growing with time because it is the only medium for communication in many countries.\n\nBecause history gives us the tools to analyze and explain problems in the past, it positions us to see patterns that might otherwise be invisible in the present – thus providing a crucial perspective for understanding (and solving!) current and future problems.",
        "Likes": 0
    },
    {
        "idx": 21,
        "Username": "nicholas-penfold-gms-8576b545",
        "Comment": "I was very good at English but regrettably i didn't like Shakespeare whatsoever . H.G Wells ,  Charles Dickens & John Keats are the real Aces in my opinion. I detested science,  but that was partly due to a ghastly teacher insulting me. He who is quite legendary in Sandwich . Portly children, short or small children were picked on in the same manner with verbal bullying  insults. Today there would a legal challenge made for sure . Lucky he retired then isn't it. Time is also a great healer in cases like these.\nI am not mistaken because he picked on my wonderful wife some twelve years later . Helen is big , beautiful & clever , she also attained a double A in science  . Yet was often called S***.\nHow difficult it is then ,when one has ADHD & Dyxlexia to take on  the pains that are Algebra, Equation & Logarithm. Arithmetic was generally easy up until that point .I humiliated myself by copying figures from my old pal Mike Burch  who was very proficient , helpful & hardworking . However this was done in a hurried muddled confusion just to keep- up some kind of make believe  momentum. \nSadly & not surprisingly it made no difference whatsoever & perhaps its the most just conclusion in this instance & in this particular case . ©️",
        "Likes": 1
    },
    {
        "idx": 22,
        "Username": "tiago-s-833868196",
        "Comment": "As an educated guess, it will be Math for most. But even Mathematics can be written 'poetically', albeit highly dependent on good influencers if it makes you spend a reasonable amount of time enjoying learning it. Looking back on my academic journey, none of the list was my least favorite subject. I even really liked Sports, especially athletics and football.",
        "Likes": 1
    },
    {
        "idx": 23,
        "Username": "insanedeveloper",
        "Comment": "There are many ways to help someone understand math. The outcome is always the same, no matter what technique you use to get to the answer, if the person clicks with it, they will arrive at the same ability as everyone else that can do that particular type of math, and the same answers to the curriculum's tests. Creativity is not punished if the student finds a unique but ultimately correct way of getting to the answer.\n\nShort of copying someone else's work, you'll never have two people answer the same for the majority of what is taught in English. So how do you coach or teach such a subjective subject without killing creativity? Who here remembers what happened to the students who disagreed that Romeo & Juliet was a tragedy?  English --  A subjective subject that seems to have only one narrow range of correct answers based mostly on who's teaching it. There's got to be a better way!",
        "Likes": 1
    },
    {
        "idx": 24,
        "Username": "eswara-kumar-p",
        "Comment": "Mr.Bill Gates - \n\nMy Least Favourite is Math...\n\nThat's Why I have Invalidated Concept of Money by Principle of Existential Independence. 😀\n\nMy LinkedIn Poll to You:\n\nTheory of Neuroplasmic Evolutionary Emergence:\nAs I am about to Propose a New Evolutionary 🧬 Theory in Biological Science: Theory of Neuroplasmic Evolutionary Emergence that has Applications in Deriving Natural Intelligence, How Many of You Know Germplasm Theory ?\n\n1. I Know Germplasm Theory\n2. I don't Know Germplasm Theory\n3. I Want to Know Germplasm Theory\n\nMy Choice: \n1. I Know Germplasm Theory\n\nIf You don't Know the Germplasm Theory, Please Make Sure to Get Upto its Theory... ☄️🌎🌧️🌈🧬🍄🍁🏝️🌳🌻💐🕊️🏡\n\nThanks!\nEswar.",
        "Likes": 1
    },
    {
        "idx": 25,
        "Username": "valentina-schindler-m-a67191ba",
        "Comment": "It was Physics and Math; however, later on, I got an excellent Math teacher and decided to take Maths as a good challenge and target my weaknesses. Long story short, I got into University because I got a high score in Math, a higher score than those subjects I considered easier. Targeting your weaknesses and finding a good teacher/professor is key. Everyone can learn anything. Maths will take you far. Maths are everywhere, in personal finances and how you build relationships with others. ",
        "Likes": 2
    },
    {
        "idx": 26,
        "Username": "lore-urrea-1424b01a7",
        "Comment": "Sr. you can be a genius at making money! but not in giving good advice. The human being is like a computer, if you leave it without constant educational stimuli, it becomes incaic. why would you say? Because without education we return to the Middle Ages! the maths. It doesn't teach how to be empathetic. It does not teach not to abuse minors, it does not teach not to contaminate, it does not teach that drugs are bad, that fashion is also bad because it contaminates, and it does not teach that we have to read the labels on food containers, to You will find a chemical in the manufacturing compound that can kill us with cancer! and finally his mathematics. They don't teach me that the flour in hamburgers, pizza, spaghetti, bread, rice, sugar. They lead to obesity, diabetes, arthritis, lupus!",
        "Likes": 1
    },
    {
        "idx": 27,
        "Username": "mohammad-johirul-islam-29400a243",
        "Comment": "I always equally love anything that comes my way. I am unable to choose any option because I know (not Believe) for sure that I am a servant of my duties. My duty is my religion- a must job! I try as best as I can to put Honey that is free of cost (not the old one found in stores) into my duties.\nDear Mr Gates, \nI know (not believe) You are a HoneyBee!!! \nAt the very early stage, You bury Yourself in the soil, embrace the darkness, enjoy the sweet taste of Patience and complete Silence, and now you are a Honey Bee!! \nYou produce honey with joy and happiness not for You but for others. Once, You tried to taste Your own produced honey, but You did not enjoy it!! 🙏🙏🙏",
        "Likes": 0
    },
    {
        "idx": 28,
        "Username": "dayang-suharrianah-464073243",
        "Comment": "The education should not be graded based on our intellectual range, everybody have their on pace time to achieve what their dream, everybody have their own specialist talent to show off to the world. People now didn't see their employees based on the character professional on their job scope but still picky whose their like even those people didn't follow the requirements of job scope.  Saw the Unfairness there ",
        "Likes": 1
    },
    {
        "idx": 29,
        "Username": "augustine-oby-obiorah-phd-097514121",
        "Comment": "Going by this list...my best was #Maths; second best was #Sciences(Physics, Chemistry, Biology); third best was #English......I ended up as an #Economist.\n\nHow it affected my Children \nMy Three Children all Girls...The First yob:2004 [still undergraduate in BSc(Electrical Electronics)]....The second yob:2007[fresh undergraduate in MBBS(Medicine & Surgery)]....My last daughter yob:2008 planning to enter University next year for BPharm(Pharmacy)]\n\nyob = year of birth.",
        "Likes": 1
    },
    {
        "idx": 30,
        "Username": "abezbornik",
        "Comment": "One thing I found frustrating about math, especially after 6th grade, is that what we were learning seemed to have less and less practical application. It was more akin to puzzle-solving than to anything with real-world practical applications. This continued through my undergraduate years. The lone and notable exception was in my statistics and data analysis education (shout out to Harold Stolper), which has virtually limitless applications and requires the development of broader critical thinking skills.\n\nIf I had my way, statistics would be more heavily emphasized in American mathematics education.",
        "Likes": 0
    },
    {
        "idx": 31,
        "Username": "raghukodanda",
        "Comment": "Math was tough on me !! and is tough on my son too. !!!!!!!! \nHowever, given the technology landscape and the ever increasingly exposure to AI, I increasingly understand the need for a strong math foundation. I spend multiple hours every week to explain to my son as to how math is useful to us in our daily life and how we use them unknowingly.\nI enjoy Learning Math Again, though I don't remember when I unlearnt it, possibly because I dint learn it t right way.\nBut trust me, Math is giving me a Second chance !!, and am doing well !!!, learning it along with my Son, and this time, learning it the right way, by understanding it and knowing the applications of it.",
        "Likes": 0
    },
    {
        "idx": 32,
        "Username": "happybains",
        "Comment": "Dear Bill, sir, Personal life school or public school? \n\nIn my life school, all subjects I invented were fascinating to failure to life-improving and advancing.\nIn public school, the least unappreciated/ or favourite was the ignorance to avoid not teaching people skills which may lead to the abundance in Math, English, Science, History and beyond.\nThey never taught people skills (Unfortunately, until today, they don't teach them). Everything we buy or sell is to people and live around with people. So many remain...\nThank you for creating this genius poll, dear Mr. Bill; it is so admirable. 😊 ",
        "Likes": 1
    },
    {
        "idx": 33,
        "Username": "craig-coppock-87b59033",
        "Comment": "Folks, I have an idea to help engage our youth and young adults.  It is a bit different and will take some time… ODYSSEY:  A COMMUNITY LEVEL YOUTH ENGAGEMENT ARCHITECTURE (ResearchGate.net) and in my profile here, is an idea to have a semi-automated program ‘host’ other programs and educational events that engage youth.  It does so by hiring our community’s professionals, craftsmen, artisans, and educators as part-time contractors to offer short exciting and engaging educational events based on their expertise.  Take a look, let me know what questions you have.  Let’s get started in our efforts to build safe and engaging communities.  We can build a future worth looking forward to.",
        "Likes": 0
    },
    {
        "idx": 34,
        "Username": "kaiser-sayeed-569897162",
        "Comment": "I love to teach Maths for lower Grades & Science for Higher Grades. I worked as a Principal for 35 years in Induan Institute Of Chemical Technology School Hyderabad & now working as School Incharge for VIP’s International School affiliated to Cambridge.l have flair for teaching & had been adjudged as the best administrator apart from teaching Maths , Biology& English.",
        "Likes": 1
    },
    {
        "idx": 35,
        "Username": "albi-ndoni-a8826816",
        "Comment": "Chemistry",
        "Likes": 7
    },
    {
        "idx": 36,
        "Username": "jetinder-jet-sira-1978708",
        "Comment": "Bill Gates - Lets flip this on its head.........My favorite and best subject in school was Computer Studies/Computer Science, in this subject I excelled I was in the top 3 of the best Computer Studies/Computer Science in my school, thats how good I was.\n\nI loved computing as I could program computers and think logically, after I left school when I got in work I did well in my IT career as 2 decades of IT experience proves that.\n\nOne of my least favorite subjects in school was Maths, I hated it and still do.......As long as I have a formula to work some thing I use a calculator to give me the correct numbers.\n\nI can also write a simple program in BBC Basic to give me the same \n.i.e.\n10 print a * b / c - v + h\n\nI can easily understand logic and formula like the above but I hate numbers perhaps I'm dislexic in maths dunno.....",
        "Likes": 0
    },
    {
        "idx": 37,
        "Username": "nidhi-kharbanda-b7b6064a",
        "Comment": "Nice one Bill Gates. I will definitely listen to the playlist. :) Those who understand Hindi, there is a very popular chartbuster in Bollywood from late 80’s- ‘Ek Do Teen Char..’ that describes how a girl spends the entire 30 days of the month waiting on her love to return picturized on actress Madhuri Dixit. Many toddlers learnt counting listening to it. Do listen and enjoy her dance! By the way my least favorite subject at school was History until we found a great teacher in High school who changed my opinion about it. He sadly passed away sometime ago but not before bringing a positive change to many students like me! #musicbringsusalltogether",
        "Likes": 1
    },
    {
        "idx": 38,
        "Username": "janvi-malik-80983018a",
        "Comment": "interestingly,\ni used to enjoy all four subjects dearly... probability , geometry, algebra , trignometry were my favt.... christmas carol and such beautiful stories read in english... science and such facts expanded my brain... history was ever so interesting full of stories from the past... stats and accounts were boring and i made them my career... Lol",
        "Likes": 1
    },
    {
        "idx": 39,
        "Username": "gareth-wells-b6a30217",
        "Comment": "Math. Unfortunately I needed a good math grade to get a place on the course (Pharmacy) I thought I wanted to do. Didn’t happen. So I took a Humanities degree (Archaeology), travelled, met incredible people, travelled some more, had a fantastic first career and then changed direction when the time came. Now I work with technologists in government. Sure, nothing to do with archaeology but…that Humanities degree taught me to be curious and interested in all kinds of things. Math is great, but curiosity rocks.",
        "Likes": 1
    },
    {
        "idx": 40,
        "Username": "anastasia-kouki",
        "Comment": "Most favourite was philosophy, that is not an option here, unfortunately. Even though I believe all sciences is a combination of Maths and Philosophy,  I didn't like the way Maths was being taught at school. Probably, because as the origin of the word indicates you need someone to teach you maths (mathematics comes from the Greek word μάθημα which means lesson). And you need someone good, maths needs to be taught in a very interactive and applicable to reality way in order to prosper in children's mind.",
        "Likes": 1
    },
    {
        "idx": 41,
        "Username": "xian-edwards-ma-666ab1b6",
        "Comment": "I hated math with a passion! Perhaps it could have been more practical for daily life usage. I recall some math used to be 3 pages plus, and I had to remember formulas, etc. Then, my math teacher used to beat the daylight out of us if we didn’t get the math equations correct or remember specific formulas. Lol. Those were the good old days 😂😂😂😂! Math, to me, was just boring as hell. I am having anxiety just remembering high school math 😂😂😂",
        "Likes": 0
    },
    {
        "idx": 42,
        "Username": "phdkatarzynazapala",
        "Comment": "Or maybe it is high time to check the products of the ongoing project on numeracy - NUMERACY IN PRACTICE - www.cenf.eu? We are working to devise the materials for adults who lack numeracy skills and for trainers to provide them with ready-to-use materials. Should Anybody has any question, I remain at Your disposal because math counts. :)",
        "Likes": 1
    },
    {
        "idx": 43,
        "Username": "aniruddhapimpalkhare",
        "Comment": "Hello Bill:  please split science into Physics, Chemistry etc. I will be glad to take revenge by choosing Chemistry. ",
        "Likes": 8
    },
    {
        "idx": 44,
        "Username": "moumita-chowdhury-510a5b70",
        "Comment": "Dear Bill, I was scared of History in my school days as i am not good with dates. But on the other hand i feel that history makes us feel proud by enlightening us with the act of brilliant and brave people .Also, i feel history lets us not repeat the mistakes that was done in the past.",
        "Likes": 2
    },
    {
        "idx": 45,
        "Username": "marc-l-kleinhenz-07331047",
        "Comment": " I wonder if math is the issue not because of the conceptual nature of math but that many math teachers are not skilled communicators. History English and even science or communication heavy pursuits but math is often solitary.  I have found very few math teachers patient or driven to teach. There are always exceptions. I know my geometry teacher was incapable of communicating the relevance in the real world. It was not until I explored carpentry and roofing that angles, area, capacity, and volume all really made sense. ",
        "Likes": 0
    },
    {
        "idx": 46,
        "Username": "vitalpowertransformations",
        "Comment": "It wasn’t the subject that was bad. It was the teachers. It was always the high school football coaches, who are talking guy language and telling stories. They didn’t really teach math well. Or make it interesting.",
        "Likes": 1
    },
    {
        "idx": 47,
        "Username": "iryna-kogut-5064503a",
        "Comment": "None of above actually)) I maybe liked little bit less Physics, but Chemistry was always favorite, so I’m having difficulties with having to choose only out of exactly these 4. Anyhow most of teachers in my school were able to pass us the knowledge with passion and I really enjoyed learning many things at the time.",
        "Likes": 1
    },
    {
        "idx": 48,
        "Username": "ahmadalghamdi",
        "Comment": "A playlist with numbers for song titles and Metallica doesn't have the opener spot? Must have been a hard choice for you Bill.",
        "Likes": 1
    },
    {
        "idx": 49,
        "Username": "claudia-aragón-b4a42b18",
        "Comment": "Thanks!",
        "Likes": 0
    },
    {
        "idx": 50,
        "Username": "kodie-egenolf",
        "Comment": "Wondering if the reverse is true. I hate math but love history, is the exact opposite for the math lover?",
        "Likes": 1
    },
    {
        "idx": 51,
        "Username": "taltalon",
        "Comment": "Awful math teachers. if you are behind, or its difficult for you, the education system does not give a damn. at least here in Israel. you drag behind. hated this subject. hated the teachers. \nHad a private math teacher one summer before they almost kicked me out of school - what a difference. the patience. the help. the empowerment. \nThere are no bad students. There are BAD & HORRIFIC teachers. ",
        "Likes": 2
    },
    {
        "idx": 52,
        "Username": "vasilis-hatzopoulos-b8150710",
        "Comment": "History because it was always taught, or felt so, as rote memorization of large pieces of text with no cultural or context to interpret or understand it’s significance. It took me 20 years to get over the trauma and re examine the topic",
        "Likes": 1
    },
    {
        "idx": 53,
        "Username": "helen-nie-475254b5",
        "Comment": "Can I say: Chinese Literature(语文）Too hard. You know ancient Chinese literature is extremely complicated. One word can have different interpretations. Then, Chinese Examation asked you to write in limited time. I always feel nervous to write in their standardized test. Even though I enjoy reading and thinking.",
        "Likes": 2
    },
    {
        "idx": 54,
        "Username": "nicholas-kaethner-038bb01",
        "Comment": "Please give another choice, like \"other\" , as I enjoyed all of these and can't answer this \"as is\".\nJust because I specialised in science and maths after 16 doesn't mean I didn't really enjoy English and history...",
        "Likes": 1
    },
    {
        "idx": 55,
        "Username": "alexnicolin",
        "Comment": "My class had a math, physics & computer science profile but I did enjoy pretty much all subjects except social science. I've always enjoyed STEM, but also history, geography and economics, and I do read a lot from those areas even now.",
        "Likes": 3
    },
    {
        "idx": 56,
        "Username": "glenn-weinreb-95b27",
        "Comment": "Bill,\n \nWhat about the Gates Foundation producing or sponsoring a documentary film?\n \nTITLE: The Climate Solution\n \nINTRO: An exploration of what would happen if the world actually did transition to a green economy over 30 years. More specifically, if it was done at the lowest cost to society, how much would it cost, and what would be done physically?\n \nREFERENCE:\n \nThe Climate Solution\nhttps://www.youtube.com/watch?v=gfP_Zqg69Ew\n \nHow Much Would a Green Grid Actually Cost?\nhttps://www.youtube.com/watch?v=ociw32DZCSo",
        "Likes": 2
    },
    {
        "idx": 57,
        "Username": "bobby-smith-1714a361",
        "Comment": "I’d have to say math, I felt that I won’t need to use much more than what I learned in middle school as far as that goes. I loved history and English, in fact I still watch YouTube non stop about history and love to travel. I really think that math is great to study for some but in my case I can pay someone sho worked hard and learned math to handle the bigger equations.",
        "Likes": 2
    },
    {
        "idx": 58,
        "Username": "pritish-asthana",
        "Comment": "Maths and Science is based on Logic ... History defines us .. \n\nEnglish - which is what we use extensively for communication, but sometimes I still grapple to find the logic behind pronounciation : why is \"Go\" - Go and \"To\" - Too 😉 \n\nThank you for sharing a great playlist.",
        "Likes": 0
    },
    {
        "idx": 59,
        "Username": "serhat-kart-751ba457",
        "Comment": "It is not about lesson It is about teacher. Your favorite lesson is the lesson of your favorite teacher.\n",
        "Likes": 12
    },
    {
        "idx": 60,
        "Username": "michael-diesch-178ab035",
        "Comment": "I never liked grading where your score was subjective and left to the teachers opinion. As an adult I understand to play to my audience since I’m in sales but as a child…. I was not prepared.",
        "Likes": 1
    },
    {
        "idx": 61,
        "Username": "calen-envious-mods-833493104",
        "Comment": "My favorite was STEM programs. I was fortunate to be the 1st of a new pilot program. It taught me electrical design, engineering, fabrication and robotics. I learned more in that one class than I probably learned during the rest of my schooling career. ",
        "Likes": 1
    },
    {
        "idx": 62,
        "Username": "subramanyeswar-saladi-6bb161237",
        "Comment": "Do you provide aid to schools in Africa.\nWhat do you think of schools in India and how they have fared in the last 30 years. Schools seem to at the end when it comes to progress.",
        "Likes": 1
    },
    {
        "idx": 63,
        "Username": "linda-hopman",
        "Comment": "I think this has more to do with struggle aversion than subject preferences. Learning comes from struggle. To have growth you have to be willing to let yourself be uncomfortable for a while as you figure things out.",
        "Likes": 1
    },
    {
        "idx": 64,
        "Username": "r-k-sanvi-yadav-52462b270",
        "Comment": "Science ",
        "Likes": 0
    },
    {
        "idx": 65,
        "Username": "ana-pehar-7973b1104",
        "Comment": "History\n",
        "Likes": 0
    },
    {
        "idx": 66,
        "Username": "waqar-ahmed-87375a96",
        "Comment": "History ",
        "Likes": 0
    },
    {
        "idx": 67,
        "Username": "dea-marin",
        "Comment": "PE - I love sports but it was always stuck in between the 2 subjects like Maths and Physics. Not being given extra time to shower, the class would continue on to smell for the next couple of hours... 🙃 ",
        "Likes": 1
    },
    {
        "idx": 68,
        "Username": "patrick-hughes-0772bb3",
        "Comment": "Think it depends a lot on the teacher. All good subjects and a good teacher who cares, is enthusiastic and knows how to teach can bring the subject to life. ",
        "Likes": 1
    },
    {
        "idx": 69,
        "Username": "pouria-jahandideh-879040157",
        "Comment": "I didn't like History because at that age I didn't know its significance, now sometimes I have questions and read about the historical facts to have some context. I think material to learn  should be on demand.",
        "Likes": 1
    },
    {
        "idx": 70,
        "Username": "jaweria-khan-247a77285",
        "Comment": "History",
        "Likes": 0
    },
    {
        "idx": 71,
        "Username": "ben-dhifallah-nesrine-006a9b200",
        "Comment": "History",
        "Likes": 0
    },
    {
        "idx": 72,
        "Username": "hudz-hadid-46801614b",
        "Comment": "History",
        "Likes": 0
    },
    {
        "idx": 73,
        "Username": "hemant-yadav-b6560b299",
        "Comment": "History ",
        "Likes": 0
    },
    {
        "idx": 74,
        "Username": "vandana-singh-176b45299",
        "Comment": "History ",
        "Likes": 0
    },
    {
        "idx": 75,
        "Username": "rajabala-kulanthaisamy-4b601249",
        "Comment": "Math often becomes boring when many math teachers solely focus on teaching the mechanics of math without providing real-life examples for context. Similarly, history can also be dull without proper contextualization. The human brain is inherently wired to understand information within a relevant context. This emphasizes the significance of teacher training, rather than attributing students’ lack of interest or understanding to the subject matter itself.",
        "Likes": 0
    },
    {
        "idx": 76,
        "Username": "william-sutherland-1465385a",
        "Comment": "French was my least favorite subject because the teacher couldn't control the class. ",
        "Likes": 1
    },
    {
        "idx": 77,
        "Username": "realm-of-dreams-llc-69394818",
        "Comment": "Can I get your email in my inbox?",
        "Likes": 1
    },
    {
        "idx": 78,
        "Username": "guinwhite",
        "Comment": "Early on I had math teachers who were uncompassionate and less than supportive. It led me to do poorly in the subject and avoid the classes altogether later in school.",
        "Likes": 2
    },
    {
        "idx": 79,
        "Username": "jose-antonio-vela-dominguez-57b97366",
        "Comment": "You start to like the history as you get older.",
        "Likes": 1
    },
    {
        "idx": 80,
        "Username": "ranjit-kaur-4663a6286",
        "Comment": "Sicelnce",
        "Likes": 0
    },
    {
        "idx": 81,
        "Username": "randall-ramirez-b87734244",
        "Comment": "I love Pistory",
        "Likes": 0
    },
    {
        "idx": 82,
        "Username": "phil-dor-58075688",
        "Comment": "5/5 ...!",
        "Likes": 1
    },
    {
        "idx": 83,
        "Username": "brenda-goynes-53804442",
        "Comment": "Science",
        "Likes": 0
    },
    {
        "idx": 84,
        "Username": "chandrashekhar-rajput-a5548522a",
        "Comment": "English",
        "Likes": 0
    },
    {
        "idx": 85,
        "Username": "wilson-correa-80732b251",
        "Comment": "Science",
        "Likes": 0
    },
    {
        "idx": 86,
        "Username": "michael-thiemann",
        "Comment": "Particularly in my mother tongue, the school curriculum presents it as an unquestionable art form rather than a straightforward means of communication.",
        "Likes": 0
    },
    {
        "idx": 87,
        "Username": "hannah-bruner-121692159",
        "Comment": "I think it was history for me because I literally only had one class in middle school. I didn't have any in high school, so I feel like I just didn't know enough to really have a grasp of it. Once I got into college and took some art history classes I took more of an interest in learning about history in general, and now my interest in history lies in cooking, art and family culture.",
        "Likes": 0
    },
    {
        "idx": 88,
        "Username": "vincent-du-3a0b8928",
        "Comment": "History. Never felt needed to put any effort into studying it, because it was my hobby reading history when growing up.",
        "Likes": 1
    },
    {
        "idx": 89,
        "Username": "benjamin-heaney-713054100",
        "Comment": "Microsoft",
        "Likes": 0
    },
    {
        "idx": 90,
        "Username": "shivangi-tambe-datir-6a381a23",
        "Comment": "U shud share ur first ....that wud make us understand....which subject makes u rich n smart",
        "Likes": 1
    },
    {
        "idx": 91,
        "Username": "jenny-mccomb-81850911",
        "Comment": "The only subject I ever failed which was of course gym….  I really wish I could vote for it.",
        "Likes": 1
    },
    {
        "idx": 92,
        "Username": "roy-oomen-253b96167",
        "Comment": "AND \nI'm listening to the Spotify list in reverse starting at 10 and more of a SoundCloud guy lol. Sorry and then Spotify plays 3 long commercials trying to go song 🎵 9 - in skip mode. SoundCloud offers a far superior product with 10 songs selected for me, based on preference. The strength of SoundCloud is so many can upload their music - and you discover so much - newly",
        "Likes": 1
    },
    {
        "idx": 93,
        "Username": "godfreymchunguzioyema",
        "Comment": "To shed some lights — Maths and Science were my number ones. As for History, thought many teachings in my opinion were and still irrelevant (I am not by any means implying that History should be scrapped from curriculums, rather finding better ways and contents to deliver to learners). What I loved and still love about Science is the fact that Science is about facts, realities which are enhanced by being versed in Mathematics.",
        "Likes": 0
    },
    {
        "idx": 94,
        "Username": "filifimba-kamissoko-7165b922a",
        "Comment": "Always math",
        "Likes": 0
    },
    {
        "idx": 95,
        "Username": "mikethegeek",
        "Comment": "We didn't  have \"history\" thanks to far right parents. We had  \"world cultures\" by the most boring teacher in the world.",
        "Likes": 1
    },
    {
        "idx": 96,
        "Username": "rod-williams-aas-32183436",
        "Comment": "Vaccines and the billionaires pushing population control",
        "Likes": 2
    },
    {
        "idx": 97,
        "Username": "habtamu-mammo-535741254",
        "Comment": "I had no a favourite subject but I tried all until I  found that l had no skills for conventional learning.",
        "Likes": 1
    },
    {
        "idx": 98,
        "Username": "marco-bellante-66219947",
        "Comment": "I didn't have a least favorite subject but a least favorite teacher",
        "Likes": 1
    },
    {
        "idx": 99,
        "Username": "joy-silva-4b70a618a",
        "Comment": "Keep us posted!",
        "Likes": 0
    },
    {
        "idx": 100,
        "Username": "stenswenson",
        "Comment": "Some good jams!  How about this one?🎵”why was I born the nine and cursed repeatedly” 🎶\n\nhttps://spotify.link/6eAHvIhTFDb",
        "Likes": 1
    },
    {
        "idx": 101,
        "Username": "jamie-derodeff-a6a001a2",
        "Comment": "When it’s not about the math it’s about the math ",
        "Likes": 1
    },
    {
        "idx": 102,
        "Username": "paula-figueroa-37328463",
        "Comment": "I liked all .",
        "Likes": 0
    },
    {
        "idx": 103,
        "Username": "agbirior-o-90a16a104",
        "Comment": "https://youtu.be/taE5wzQl1pg",
        "Likes": 0
    },
    {
        "idx": 104,
        "Username": "almudena-rudilla-antúnez-5176077b",
        "Comment": "Pero fue en la era de los dinosaurios 🥹",
        "Likes": 1
    },
    {
        "idx": 105,
        "Username": "dariush-sotoudehnia-8749071a",
        "Comment": "I was scared of math, but was great  at trig. Science was great. ",
        "Likes": 1
    },
    {
        "idx": 106,
        "Username": "david-hazlett",
        "Comment": "Math was easy for me, barred from doing proofs in Geometry class so others could.",
        "Likes": 1
    },
    {
        "idx": 107,
        "Username": "atta-muhammad-787984267",
        "Comment": "Science,due to know how this universe work.",
        "Likes": 1
    },
    {
        "idx": 108,
        "Username": "valeriecheersbrown",
        "Comment": "I hated history because they were mostly lies!",
        "Likes": 9
    },
    {
        "idx": 109,
        "Username": "imtiaz-ahmed-b36676249",
        "Comment": "I like Tech news and update. We should allow mobile phone in all school for students to increase their knowledge. ",
        "Likes": 1
    },
    {
        "idx": 110,
        "Username": "jackie-rosenbaum-a3668535",
        "Comment": "If you saw my checkbook you would know. Off every month by hundreds lol. Usually to my benefit lol",
        "Likes": 1
    },
    {
        "idx": 111,
        "Username": "simon-ings-procurement",
        "Comment": "History because the teachers just couldn’t draw you in and make it interesting. As an adult I’ve found history fascinating thanks to various documentaries and those that presented them had passion.",
        "Likes": 1
    },
    {
        "idx": 112,
        "Username": "corina-duenas-pharmaconetworks",
        "Comment": "LOL. Seems like a playlist AI generated. But i like it. Am gonna check if ChatGPT recommendme at least two of the first ten songs in one prompt. ;)",
        "Likes": 2
    },
    {
        "idx": 113,
        "Username": "manchem-durga-rao-a1286489",
        "Comment": "How total 101%",
        "Likes": 0
    },
    {
        "idx": 114,
        "Username": "kamali-balasubramanian-009982152",
        "Comment": "Excelling in mathematics now sir",
        "Likes": 1
    },
    {
        "idx": 115,
        "Username": "timothy-haskins-148881b",
        "Comment": "Science, specifically Physics, it made math have real purpose.",
        "Likes": 1
    },
    {
        "idx": 116,
        "Username": "lakshmi-murthy-6860673",
        "Comment": "Loved the compilation of songs. ",
        "Likes": 1
    },
    {
        "idx": 117,
        "Username": "waleed-khan1",
        "Comment": "Simplify this, simplify that ...simplify simplify simplify!!! Only thing I learned from math🙃",
        "Likes": 0
    },
    {
        "idx": 118,
        "Username": "catherineshearnot",
        "Comment": "I guess math and science because I am no where near retirement and this entire experiment has been a waste of time!",
        "Likes": 1
    },
    {
        "idx": 119,
        "Username": "parkerelmore",
        "Comment": "Math is where it’s at! Science is great, but you need math to understand it.",
        "Likes": 9
    },
    {
        "idx": 120,
        "Username": "maria-peacock-819717278",
        "Comment": "Chemistry",
        "Likes": 0
    },
    {
        "idx": 121,
        "Username": "dale-ast-4111a4223",
        "Comment": "Thanks Bill.",
        "Likes": 0
    },
    {
        "idx": 122,
        "Username": "reicha-nariemanni-a06067275",
        "Comment": "Chem, mechanics, and electromagnetism but started really liking chem once tutored.",
        "Likes": 1
    },
    {
        "idx": 123,
        "Username": "araasomuhammed",
        "Comment": "History is literally useless",
        "Likes": 1
    },
    {
        "idx": 124,
        "Username": "thiago-barros-bongiovani",
        "Comment": "Bill Gates missed the band my math teacher liked 10.000 maniacs",
        "Likes": 1
    },
    {
        "idx": 125,
        "Username": "abhay-kumar-mishra-4904b685",
        "Comment": "Unfortunately landed with arts",
        "Likes": 1
    },
    {
        "idx": 126,
        "Username": "jagjeet-singh-670912199",
        "Comment": "technical subject ",
        "Likes": 0
    },
    {
        "idx": 127,
        "Username": "glen-austin",
        "Comment": "Mainly because of how they taught it.  They didn’t tel the stories they just presented facts and figures.   Julius Ceaser was Emperor from blah to blah.   Or tell the story of how he was in battle with the Roman Senate and marched across the Rubicon to defeat the Republic and establish his absolute rule.   Which is more interesting.   Also, I’ve learned that history doesn’t repeat itself, but it does rhyme!!!",
        "Likes": 2
    },
    {
        "idx": 128,
        "Username": "tummalapally-muraly-a902b01a3",
        "Comment": "Math...Math..,.Math",
        "Likes": 0
    },
    {
        "idx": 129,
        "Username": "muumar",
        "Comment": "Neither.",
        "Likes": 0
    },
    {
        "idx": 130,
        "Username": "paigham-khan-09444a213",
        "Comment": "History is my all time favorite subject. After that literature.",
        "Likes": 1
    },
    {
        "idx": 131,
        "Username": "lungu-pusa-aa41b5231",
        "Comment": "My son has a very high IQ. And you like mathematics a lot, he has a master's degree in computer science and the faculty of psychology. He is 48 years old, he is , now, a computer science teacher at a grammar school in the UK. I really want to work for a company as big as yours!!!",
        "Likes": 0
    },
    {
        "idx": 132,
        "Username": "nanette-fuller-b133b2b6",
        "Comment": "While I was a 4.0 student, I hated history! Specifically American history.  I excelled at Math and Science and always thought my career path would take me in that direction.   Life, on the other hand, had other plans for me.  Now, 25 years later, I struggle to follow my Sons HS math and dislike the current history teachings, or lack there of.",
        "Likes": 0
    },
    {
        "idx": 133,
        "Username": "anthony-davies-2706b050",
        "Comment": "Thank you Mr.Gates for your thoughtful Pole. We always appreciate the fine products you produce and the advice you give. Take care and be well Sir..",
        "Likes": 1
    },
    {
        "idx": 134,
        "Username": "ddumba-nelson-02144a21a",
        "Comment": "history",
        "Likes": 0
    },
    {
        "idx": 135,
        "Username": "daniel-doe-6048b91b8",
        "Comment": "Linguistic memory was not great, math memory was great.   History with my favorite teacher and worst testing result.  ",
        "Likes": 1
    },
    {
        "idx": 136,
        "Username": "mandisoleil",
        "Comment": "I found math instructors in grades 6-12 brought zero spark to our coursework. I went from practicing multiplication tables for fun to developing a great distaste for math nearly instantly upon entering middle school.\n\nThen, the University of Minnesota calculus series hit me with Cupid’s arrow 💘 and I love it once again. Teachers can have such a notable impact!",
        "Likes": 1
    },
    {
        "idx": 137,
        "Username": "biplabkar436",
        "Comment": "All were my favourite subjects.",
        "Likes": 1
    },
    {
        "idx": 138,
        "Username": "dalia-prieto-30ba5178",
        "Comment": "Math was my least favorite..",
        "Likes": 3
    },
    {
        "idx": 139,
        "Username": "mark-riomondo-951551b1",
        "Comment": "With the exception of Geometry, I did not like math at all.  I loved History, Government and Science.   In college Organic Chemistry was my nemesis.",
        "Likes": 1
    },
    {
        "idx": 140,
        "Username": "shreya-mahajan",
        "Comment": "dope playlist! \n",
        "Likes": 1
    },
    {
        "idx": 141,
        "Username": "ira-armiri-b79127146",
        "Comment": "It is not in this list.",
        "Likes": 1
    },
    {
        "idx": 142,
        "Username": "hasibur-rahman-053b94125",
        "Comment": "I love to read and know about history. But unfortunately, I can't remember afterwards.",
        "Likes": 1
    },
    {
        "idx": 143,
        "Username": "hoby-heriniaina-787901203",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 144,
        "Username": "abdul-hanan-732269260",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 145,
        "Username": "latha-rao-824937171",
        "Comment": "Maths",
        "Likes": 0
    },
    {
        "idx": 146,
        "Username": "awababy-camara-61152a298",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 147,
        "Username": "amit-yadav-47325825a",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 148,
        "Username": "kuwnar-akash-singh-kushwaha-5483061a5",
        "Comment": "Maths",
        "Likes": 0
    },
    {
        "idx": 149,
        "Username": "larry-lane-93b486213",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 150,
        "Username": "david-mccrae-24946716",
        "Comment": "physics!!!!  loved graphics, english, geography",
        "Likes": 1
    },
    {
        "idx": 151,
        "Username": "lyrdeng",
        "Comment": "Maybe add Physics? Love all of the 4!",
        "Likes": 1
    },
    {
        "idx": 152,
        "Username": "natnael-tadele-583689246",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 153,
        "Username": "patricia-robinson-00996570",
        "Comment": "Should have had other..",
        "Likes": 1
    },
    {
        "idx": 154,
        "Username": "latashree-bomma-32b07966",
        "Comment": "Least favourite …studying",
        "Likes": 1
    },
    {
        "idx": 155,
        "Username": "angela-rosalia-calderon-godoy-3bb95263",
        "Comment": "English und History",
        "Likes": 0
    },
    {
        "idx": 156,
        "Username": "ms-bella-anis-0020aa20b",
        "Comment": "I'm not good at math🙃",
        "Likes": 0
    },
    {
        "idx": 157,
        "Username": "bhushit",
        "Comment": "Of course history!\nIt taught how bad we could be to each other.\nIt was also a constant reminder of \"you can't change\".\n\nRather, I wished they taught us 'time as a whole'. Past, that should be learned from; present, to manage priority and future, how it should be and how it may be achieved, and how attempts may fail.",
        "Likes": 0
    },
    {
        "idx": 158,
        "Username": "rick-burton-9a7753220",
        "Comment": "Math!",
        "Likes": 0
    },
    {
        "idx": 159,
        "Username": "jason-gatty-30b6878a",
        "Comment": "None!",
        "Likes": 0
    },
    {
        "idx": 160,
        "Username": "chris-sattler-6487728a",
        "Comment": "I would have to say Biology. ",
        "Likes": 1
    },
    {
        "idx": 161,
        "Username": "betty-arnoldt-357b8587",
        "Comment": "Shorthand.. I guess that gives you sense of how old I am🤣",
        "Likes": 2
    },
    {
        "idx": 162,
        "Username": "john-salvarinas-082938223",
        "Comment": "Never met an equation I never liked...",
        "Likes": 1
    },
    {
        "idx": 163,
        "Username": "nick-novak-homes-at-nrg-realty-697742119",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 164,
        "Username": "winstonrajendram",
        "Comment": "Physics",
        "Likes": 0
    },
    {
        "idx": 165,
        "Username": "rebecca-mason-msc-ba-hons-413608148",
        "Comment": "I really enjoyed all my lessons in high school because of the teachers. They were really enthusiastic about the subject areas and made it interesting!",
        "Likes": 1
    },
    {
        "idx": 166,
        "Username": "claire-picone-82aaa318",
        "Comment": "None",
        "Likes": 0
    },
    {
        "idx": 167,
        "Username": "juan-e-millan-54ba42150",
        "Comment": "All",
        "Likes": 0
    },
    {
        "idx": 168,
        "Username": "monkee-bizz-b1969b89",
        "Comment": "I'm done with r3conciliation",
        "Likes": 0
    },
    {
        "idx": 169,
        "Username": "shaniqua-woods-6b613719b",
        "Comment": "https://gofund.me/55273acf",
        "Likes": 0
    },
    {
        "idx": 170,
        "Username": "lucas-lis-49b41b195",
        "Comment": "Plot twist: I love them all.",
        "Likes": 0
    },
    {
        "idx": 171,
        "Username": "maheas-mukti-b204011a3",
        "Comment": "Sir ",
        "Likes": 0
    },
    {
        "idx": 172,
        "Username": "paul-b-88307b9",
        "Comment": "Technology",
        "Likes": 0
    },
    {
        "idx": 173,
        "Username": "hassan-djasim-ismail-3a082a51",
        "Comment": "History still my best one!",
        "Likes": 1
    },
    {
        "idx": 174,
        "Username": "carla-swanson-carroll-92750b9",
        "Comment": "I love math, have a BSA, MPA and working on my MBA",
        "Likes": 1
    },
    {
        "idx": 175,
        "Username": "brenda-wright-53a6a910",
        "Comment": "Loved them all. Math was hardest, though. ",
        "Likes": 1
    },
    {
        "idx": 176,
        "Username": "bruna--ferreira",
        "Comment": "I miss “When I’m sixty four”, by the Beatles, in your Spotify list Bill Gates. 😉",
        "Likes": 0
    },
    {
        "idx": 177,
        "Username": "slozella-mcdonald-449a16230",
        "Comment": "None ",
        "Likes": 0
    },
    {
        "idx": 178,
        "Username": "olsonyarzagaray",
        "Comment": "This is hard because I liked all four of these subjects",
        "Likes": 1
    },
    {
        "idx": 179,
        "Username": "tetiana-dombrovan-dr",
        "Comment": "Your liking or disliking of a subject is much determined by the personality of the teacher. I was lucky to have good teachers at school. Though we did not have such great technologies as today’s students, our lessons were interesting and informative. Luckily, today our children have far more access to knowledge and skills",
        "Likes": 1
    },
    {
        "idx": 180,
        "Username": "pamela-agyemang-90256089",
        "Comment": "We were never taught about BLACK HISTORY! \nThe only black history we were ever taught in school was SLAVERY…..never about the black people who made history. \nIt was always a dreadful experience \n\nI think the teachers found joy in watching a bunch of black girls coming out of their classrooms crying their eyes out.",
        "Likes": 2
    },
    {
        "idx": 181,
        "Username": "chathurani-gheekiyanage-9bb70344",
        "Comment": "Like all those subjects..Anyway Maths , English , Science are always in the favourite list…",
        "Likes": 1
    },
    {
        "idx": 182,
        "Username": "hossein-esmaeilzadeh-420aaa228",
        "Comment": "english\n",
        "Likes": 0
    },
    {
        "idx": 183,
        "Username": "stephen-cyrus-nkrumah-30579685",
        "Comment": "English  was a bit difficult aspects of me because I was afraid I might make a mistake for others to laugh at me. Until I entered university where my communication skills lecturers polishes me and even had 100% in quizzes and final exams. Thanks to Mrs Taylor head of English department and Philosophy lecturer (Ntitan) UEW Kumasi Campus.",
        "Likes": 0
    },
    {
        "idx": 184,
        "Username": "john-laforest-02102211a",
        "Comment": "Bill ? I'm seriously not playing there's a Jehovah God and a king Jesus , when I was younger Jesus said do not fear ,, so I tell you he's real in Jesus name enjoy your day that our father made for us all .. ",
        "Likes": 0
    },
    {
        "idx": 185,
        "Username": "bro-m-bro-a8b477235",
        "Comment": "Every day we use math for life",
        "Likes": 0
    },
    {
        "idx": 186,
        "Username": "supritidas",
        "Comment": "Subject is not here — Geography",
        "Likes": 0
    },
    {
        "idx": 187,
        "Username": "jermie-bowen-7a36b019b",
        "Comment": "Memorizing the dates of particular events.",
        "Likes": 0
    },
    {
        "idx": 188,
        "Username": "jaskaran-sharma-115159202",
        "Comment": "All the subjects are good",
        "Likes": 0
    },
    {
        "idx": 189,
        "Username": "terry-frost-a07b5211",
        "Comment": "I liked them all equally 😎",
        "Likes": 1
    },
    {
        "idx": 190,
        "Username": "dean-arlington-bb1ab66",
        "Comment": "Great Playlist. History wasn't my favorite. I was great in music, but not in the arts. People like & enjoy studying History nonetheless. Mathematics, Physics, the Sciences & English Literature were my actual favorites; however, also recess time was also a favorite. I love sports. Best, Dean A.",
        "Likes": 0
    },
    {
        "idx": 191,
        "Username": "jonathan-cobi",
        "Comment": "Chemistry ",
        "Likes": 0
    },
    {
        "idx": 192,
        "Username": "neelum-zehra-healthcare-rehab-occupationaltherapy",
        "Comment": "It's difficult to decide since I enjoyed all",
        "Likes": 0
    },
    {
        "idx": 193,
        "Username": "linda-parzyszek-851263160",
        "Comment": "I realize I didnt nessesarily care about History when I was younger but now I wish I had paid more attention now that I am older. So those of you younger folk that dont care for World History, take my word for it , pay close attention now because you'll find it vey helpful to see what's going on in the world.",
        "Likes": 0
    },
    {
        "idx": 194,
        "Username": "brunoscintra",
        "Comment": "None. I didn't like Portuguese, despite today I like.",
        "Likes": 1
    },
    {
        "idx": 195,
        "Username": "sheena-achyuthan-pmp-pmi-acp-lssbb-itilv4-csm-cspo-95259147",
        "Comment": "Science - both Physics & Chemistry",
        "Likes": 1
    },
    {
        "idx": 196,
        "Username": "sue-sabourin-90207a137",
        "Comment": "Mass was always my favourite subject",
        "Likes": 0
    },
    {
        "idx": 197,
        "Username": "peter-leach-a5593116",
        "Comment": "Shouldn't that be Maths or Mathematics?",
        "Likes": 0
    },
    {
        "idx": 198,
        "Username": "martinsanks",
        "Comment": "You’re on, old man!",
        "Likes": 1
    },
    {
        "idx": 199,
        "Username": "innocent-fungayi-choga-3142b6108",
        "Comment": "I did not hate any subject at all. I had some that I was naturally good at and found some challenging but I did my best to tackle them. My best friends at school were the ones who were very good at those subjects I wasn’t naturally good at.",
        "Likes": 1
    },
    {
        "idx": 200,
        "Username": "nandakumar-mani-9357711a9",
        "Comment": "History",
        "Likes": 0
    },
    {
        "idx": 201,
        "Username": "babu-venu-b91a49a3",
        "Comment": "👨🏻‍💻 మీరు Digitalగా వర్క్ చేయాలనుకుంటున్నారా?\n💁🏻‍♂️ అయితే ఈ అవకాశం మీకు తప్పకుండా ఉపయోగపడుతుంది.\n🌍 ఒక ప్రముఖ Global కంపెనీలో మీరున్న ప్రాంతం నుండే Digitalగా Smartphoneతో వర్క్ చేస్తూ ప్రతీ నెలా మంచి Income సంపాదించే అవకాశాన్ని మా కంపెనీ కల్పిస్తుంది.\n\n💥 నెలకు 15,000/- నుండి 30,000/- వరకు సంపాదించండి.\n\n👉 Age:- 20+\n\n📌 పూర్తి వివరాలు తెలుసుకోవడానికి ఈ నంబర్ కి Hi అని WhatsApp cheyandi👇\n📲 9985303690",
        "Likes": 1
    },
    {
        "idx": 202,
        "Username": "monkee-bizz-b1969b89",
        "Comment": "I'm the western Canada 3vent coordinator f I r Al-qeada/isis inc",
        "Likes": 0
    },
    {
        "idx": 203,
        "Username": "gail-akinnusotu-96826b169",
        "Comment": "I loved school\nI was not top of my class in any subject but I loved every one;)",
        "Likes": 0
    },
    {
        "idx": 204,
        "Username": "sylvain-lafleur-9a007a288",
        "Comment": "hello bill I beg you  to help we are a poor family with two autistic kids and my daughter rosalie has strong autism Pity for her she Will need help all her life give any amount of money you want congratulation for all your great carreer ",
        "Likes": 0
    },
    {
        "idx": 205,
        "Username": "olive-bbabbi-552906145",
        "Comment": "Maths, I never liked it not even abit. Just seeing the maths teacher gave me serious headaches. I only allowed myself to go through the torture sothat I could pass my exams, by then maths was a requirement to get into college. ",
        "Likes": 1
    },
    {
        "idx": 206,
        "Username": "mahidev-j-s-707694214",
        "Comment": "Those all subjects are mandatory to me while now English is more mandatory because that is the only One option moreover English were more helpful to my Career development even for my personal growth for skill developments. Absolutely now, I remember a poem written by a Nigerian writer named - Chimamanda Ngozi Adichie. \nIt's a very pleasure to see because it just encourages me to remember. ",
        "Likes": 0
    },
    {
        "idx": 207,
        "Username": "walter-atigian-8a4199248",
        "Comment": "Foreign language studies proved to be my downfall. Having an misunderstood hearing issue I couldn't match pronunciation with the written word. Especially loved math, and science and achieved a BS in botany and a degree in oil field engineering. ",
        "Likes": 0
    },
    {
        "idx": 208,
        "Username": "erica-j-93b50227",
        "Comment": "I liked those ones... I didn't like linear algebra! But I liked  other math classes,  calculus, statistics, business math, etc. Linear algebra was my nemesis ",
        "Likes": 1
    },
    {
        "idx": 209,
        "Username": "girija-ganesan-1006",
        "Comment": "I love all subjects...",
        "Likes": 1
    },
    {
        "idx": 210,
        "Username": "dustin-schwingler-96b77399",
        "Comment": "My least favorite was English, and my favorite was math! This question made me miss math class as a kid. The problems reminded me of puzzles, and it was so gratifying catching onto principles and cracking the code before your classmates 😊",
        "Likes": 1
    },
    {
        "idx": 211,
        "Username": "john-duthler-a54703150",
        "Comment": "Surprised History is so high. \nIt's basically storytelling\n.",
        "Likes": 0
    },
    {
        "idx": 212,
        "Username": "richarddemulling",
        "Comment": "I liked them all, but my favorite in School was recess!!",
        "Likes": 1
    },
    {
        "idx": 213,
        "Username": "james-blakely-5a1b05ab",
        "Comment": "History was my weakest link in high school. As a kid, I never saw the value in learning about a distant past, or the reasons why things are the way they are. Very happy I grew out of that mindset.",
        "Likes": 1
    },
    {
        "idx": 214,
        "Username": "sangeeta-kalloe-193599125",
        "Comment": "None above",
        "Likes": 1
    },
    {
        "idx": 215,
        "Username": "anolita-arvandi-köppen-6bb318",
        "Comment": "I hated music- I could never play any instruments and ended up with cymbals and once got a concussion just because I banged too loud - LOL. Until today I shy away from them.",
        "Likes": 0
    },
    {
        "idx": 216,
        "Username": "devinrenaud",
        "Comment": "I'm surprised that History beat Math in this one! I have 2 questions:\n\n1. Which subject do you think is more important Bill (they both are, but if you had to choose)\n\n2. Is 72k votes on a poll enough to use as research, or are your LinkedIn polls more for fun and interaction? ",
        "Likes": 0
    },
    {
        "idx": 217,
        "Username": "grace-buchanan-b3777816",
        "Comment": "PE",
        "Likes": 0
    },
    {
        "idx": 218,
        "Username": "theo-hurry-882926293",
        "Comment": "English Litirature",
        "Likes": 1
    },
    {
        "idx": 219,
        "Username": "ingrid-tofte-b221a61",
        "Comment": "Lovely thanx 😀 ",
        "Likes": 1
    },
    {
        "idx": 220,
        "Username": "gary-arstein-kerslake-30971228",
        "Comment": "I was seriously unenthused about English grammar. Too many exceptions, and not something I consciously considered when writing. But, I do respect people that have a deep understanding of English grammar!",
        "Likes": 1
    },
    {
        "idx": 221,
        "Username": "shanell-johnson-52a518123",
        "Comment": "I didn't have a least favorite.....",
        "Likes": 0
    },
    {
        "idx": 222,
        "Username": "erickmendez",
        "Comment": "I like math a lot more now.  I appreciate its logical elements more than English.",
        "Likes": 0
    },
    {
        "idx": 223,
        "Username": "joan-mullings-27449417",
        "Comment": "Let’s used some of that math skills to subtract some of that money to give to the poor and not addition to keep getting wealthier.",
        "Likes": 0
    },
    {
        "idx": 224,
        "Username": "monkee-bizz-b1969b89",
        "Comment": "I'm not on your side say goodbye to cn rail in westerncanada ",
        "Likes": 0
    },
    {
        "idx": 225,
        "Username": "victoria-taylor-801bb926a",
        "Comment": "It,s so cute and beautiful!",
        "Likes": 0
    },
    {
        "idx": 226,
        "Username": "dimitrios-farmakis-md-msc-a07a6a22a",
        "Comment": "I believe that the science help us to understand and live the world which surrounds us in combination with literature which help us to understand, calm and discover us our inner world . The compination for me is the emotional intelligence",
        "Likes": 0
    },
    {
        "idx": 227,
        "Username": "nicholas-clements-hr",
        "Comment": "It was history. Now I can’t get read enough biographies",
        "Likes": 1
    },
    {
        "idx": 228,
        "Username": "gisela-c-b16a61b2",
        "Comment": "Math.",
        "Likes": 0
    },
    {
        "idx": 229,
        "Username": "the-tilmont-s-201b2256",
        "Comment": "Home Economics",
        "Likes": 1
    },
    {
        "idx": 230,
        "Username": "denise-pelletier",
        "Comment": "I love Math! However,  English is not my favorite. ",
        "Likes": 1
    },
    {
        "idx": 231,
        "Username": "daniel-høifødt-957a6578",
        "Comment": "None of the above, but i had \"new norwegian\" and i hated it... hating new norwegian is a common thing for people from southern norway:p espcially oslo",
        "Likes": 0
    },
    {
        "idx": 232,
        "Username": "anupam-dev-burman-0ba9b922a",
        "Comment": "Without a shadow of doubt it's History of me. I still don't understand the point of remembering so many dates for no reason. And as an Indian I tend to be more interested in knowing my nation's history. I don't see any point in knowing a Chinese, or Russian or duniya jahan ka history. JUST MY VIEWS. ",
        "Likes": 1
    },
    {
        "idx": 233,
        "Username": "michaelprochazka",
        "Comment": "Sport",
        "Likes": 0
    },
    {
        "idx": 234,
        "Username": "germangorbachov",
        "Comment": "Where's none of the above option? I loved all these subjects, but will have to choose history in order to participate.",
        "Likes": 1
    },
    {
        "idx": 235,
        "Username": "magda-zakrzewski-2316011a",
        "Comment": "So strange it was History but I love it now.  As I get older my mind more open and understanding.  More intuitive too.  Glad you’re working with Elon.  Warm regards Magda ZaKrzewski",
        "Likes": 0
    },
    {
        "idx": 236,
        "Username": "fowler-kevin-92032625",
        "Comment": "I liked all of them.",
        "Likes": 1
    },
    {
        "idx": 237,
        "Username": "geetanjali-singh-239778126",
        "Comment": "Interesting,  there's a tie between history n maths :D",
        "Likes": 1
    },
    {
        "idx": 238,
        "Username": "rbnye",
        "Comment": "What is ironic is that I fell in love with history *after* completing my formal education. I hated how it was taught in school. Linear history has a place, sure but for me to actually *learn* history it was about the CONNECTIONS: Understanding how things developed one idea to the next. That made history come alive.",
        "Likes": 1
    },
    {
        "idx": 239,
        "Username": "tunde-kingsley-b20a777b",
        "Comment": "My favourite subject was Geography because the teacher was very encouraging and kind.",
        "Likes": 0
    },
    {
        "idx": 240,
        "Username": "sonya-harris-a86340a",
        "Comment": "History for sure. African American aka Black aka Colored aka Negro aka African history did not start with slavery. Unfortunately, the history that is taught in schools start with slavery. It wasn’t until I took an elective course in college, that I learned more about Black and African history before slavery.",
        "Likes": 0
    },
    {
        "idx": 241,
        "Username": "janice-forsythe-88281b",
        "Comment": "History because the teacher told us we could doodle on our books if we wanted. Guess what the entire class did 😄.",
        "Likes": 0
    },
    {
        "idx": 242,
        "Username": "sundeep-sharma-",
        "Comment": "Chemistry",
        "Likes": 1
    },
    {
        "idx": 243,
        "Username": "saswata-mishra",
        "Comment": "Hey Bill, why would anyone want to make anything more enjoyable if it's already enjoyable? The idea of this sounds like \"addiction\" to me! :)",
        "Likes": 0
    },
    {
        "idx": 244,
        "Username": "sampath-vuchuru",
        "Comment": "Nice! Music always makes learning more fun and entertaining. Thanks for sharing!",
        "Likes": 1
    },
    {
        "idx": 245,
        "Username": "tarie-nosworthy",
        "Comment": "I loved them all ",
        "Likes": 1
    },
    {
        "idx": 246,
        "Username": "jameskendig",
        "Comment": "Man how long did it take you to put that list together?  Very creative.",
        "Likes": 1
    },
    {
        "idx": 247,
        "Username": "angelo-koljenovic-2945aa1b1",
        "Comment": " Don't worry Mr, Bill  Perhaps? you have Nuclear Bunker in case of  world inferno all that will do prolong your life so you can see the Human misery's.. you see i have bin in heel and bake.. \n moor of my thinking in may Books  perhaps you will check it out? on Amazon.com",
        "Likes": 1
    },
    {
        "idx": 248,
        "Username": "tashna-toya-edwards-22a91a61",
        "Comment": "Chemistry to be specific 🫤",
        "Likes": 0
    },
    {
        "idx": 249,
        "Username": "abdullah-al-watari-a333101a6",
        "Comment": "I chose history coz I realized while I'm living my life right now history is being manipulated so I don't think what I've studied at school is completely right ",
        "Likes": 1
    },
    {
        "idx": 250,
        "Username": "ใหม่-ใหม่-611ba1201",
        "Comment": "You told Siam commercial move out dtac system platform bank and others bank.. Thank you very much.",
        "Likes": 0
    },
    {
        "idx": 251,
        "Username": "nanya-owens-0a09111b3",
        "Comment": "I think just about everyone at one point hated math. Until they understood what was taught, but still in my personal experience, I really just disliked doing math. ",
        "Likes": 1
    },
    {
        "idx": 252,
        "Username": "01000101lis",
        "Comment": "Math and Science",
        "Likes": 0
    },
    {
        "idx": 253,
        "Username": "andre-elen-gomes-de-brito-0165aa56",
        "Comment": "boua noite   como vai estamos com muitos plobemas  algum anos",
        "Likes": 0
    },
    {
        "idx": 254,
        "Username": "thomas-fournier-983b54288",
        "Comment": "Science & English",
        "Likes": 1
    },
    {
        "idx": 255,
        "Username": "angela-hocking-a6599082",
        "Comment": "PE as had no coordination 😜",
        "Likes": 1
    },
    {
        "idx": 256,
        "Username": "samuelsawian",
        "Comment": "Someday, History will beat Mathematics 😅",
        "Likes": 2
    },
    {
        "idx": 257,
        "Username": "emilie-coron-4b60a9104",
        "Comment": "English definitely was the worst!",
        "Likes": 0
    },
    {
        "idx": 258,
        "Username": "saroj-kc-a7392a1b7",
        "Comment": "I've grown to love math because, even if this not my favorite in daily life, maths always there. There were times when I didn't like this subject, but then I realized that even those who don't enjoy this daily have to face them. That's when I began to appreciate and enjoy this subject.",
        "Likes": 0
    },
    {
        "idx": 259,
        "Username": "btissam-e-6ba1ba85",
        "Comment": "Je ne vois pas le rapport? Ce sont de fausse excuse monsieur…pourquoi avez-vous divorcé si vite après la pandémie? \nVous savez on retrouve pas le bout d’un virus dans un autre virus…les bouffe délirante relève de la pschiatrie!",
        "Likes": 0
    },
    {
        "idx": 260,
        "Username": "alberto-rodríguez-bosshard-9b2a7572",
        "Comment": "Why does everyone today say \"science\" as if it were a single subject? (honest question). When I was in school, I loved physics but hated biology.",
        "Likes": 0
    },
    {
        "idx": 261,
        "Username": "carlos-tortosa-81452846",
        "Comment": "None! Bill, you missed sports",
        "Likes": 1
    },
    {
        "idx": 262,
        "Username": "muhammad-ahmad-652183257",
        "Comment": "Maths ",
        "Likes": 1
    },
    {
        "idx": 263,
        "Username": "eli9000",
        "Comment": "Eugenics",
        "Likes": 0
    },
    {
        "idx": 264,
        "Username": "sandeep-aryadan-a318251aa",
        "Comment": "It's all about perspective ( you've got something they don't )",
        "Likes": 0
    },
    {
        "idx": 265,
        "Username": "laurence-jennings-8b905363",
        "Comment": "I’m attracted to math, it’s explicit, clean, clear\nNo pretending true or false of the outcome.",
        "Likes": 1
    },
    {
        "idx": 266,
        "Username": "umesh-solanki-667174119",
        "Comment": "None of this",
        "Likes": 0
    },
    {
        "idx": 267,
        "Username": "gloria-la-bella-5361aa22",
        "Comment": "I’m still interested in History, Literature, and Science. 📚",
        "Likes": 1
    },
    {
        "idx": 268,
        "Username": "mramalho1454",
        "Comment": "Really nice playlist.",
        "Likes": 0
    },
    {
        "idx": 269,
        "Username": "harry-sampson-897399b7",
        "Comment": "The only part of maths I did not like was Algebra and I have never had to use in all my working life ( 1957 to 1999 when I retired). All other pars of maths I liked even Trig. ",
        "Likes": 1
    },
    {
        "idx": 270,
        "Username": "vijayjoshi24",
        "Comment": "To me, History is so ambiguous subject. As you grow up you realize that you would rather perceive history through a lot of different lenses and the majority of projections of historical events have been presented within a limited set of perceptions. It is not easy to adopt such a perception at the age when we are still in school days.",
        "Likes": 0
    },
    {
        "idx": 271,
        "Username": "adnanali31",
        "Comment": " Wow, Bill Gates, just when we think you've conquered it all, now you're blessing us with a math-inspired playlist! You never cease to amaze and inspire. Can't wait to groove to the numbers! 🎶👏 #bythenumbers #mathinspiration  ",
        "Likes": 0
    },
    {
        "idx": 272,
        "Username": "tyler-deitz-a36b6158",
        "Comment": "Virology",
        "Likes": 2
    },
    {
        "idx": 273,
        "Username": "robert-menist-89837811",
        "Comment": "Wood shop. Would’ve probably enjoyed it more if the teacher actually gave us instruction on what to do.",
        "Likes": 1
    },
    {
        "idx": 274,
        "Username": "richard-a-antwi-06404024",
        "Comment": "Maths was scary for me but when I began to seek help from my seniors I enjoyed it.However science was my headache especially physics, but I enjoyed biology.",
        "Likes": 1
    },
    {
        "idx": 275,
        "Username": "vladimer-khasia-b2b496129",
        "Comment": "russian language",
        "Likes": 1
    },
    {
        "idx": 276,
        "Username": "butrint-xhemajli-seo-expert",
        "Comment": "Nice try Bill Gates but NO thanks you’re not gonna make us learn Math!",
        "Likes": 1
    },
    {
        "idx": 277,
        "Username": "sohail-abbassi-49a1861a5",
        "Comment": "Math + science ☕🌷👏👍",
        "Likes": 3
    },
    {
        "idx": 278,
        "Username": "moumita-chowdhury-510a5b70",
        "Comment": "Dear Bill, The playlist is awesome and the marketing strategy is really cool 😁",
        "Likes": 0
    },
    {
        "idx": 279,
        "Username": "davesondergaard",
        "Comment": "History and English, were my worst subjects ask me to calculate how far I can jump a dirt bike I’d be all over that! I really wish more schools pushed STEM it’s been my passion since I was old enough to work a calculator.",
        "Likes": 0
    },
    {
        "idx": 280,
        "Username": "mdominguezb",
        "Comment": "I believe it depends a lot on how these subjects are taught to you. In my case, I always hated mathematics because we didn't have teachers who understood why some students struggle while others excel. An education focused on enhancing the subjects one likes and finds easier is important, as it makes us happy.",
        "Likes": 0
    },
    {
        "idx": 281,
        "Username": "ercole-rosario-di-iorio-91881b14",
        "Comment": "Where is science philosophy?\nWhere is psicology?\nWhere is macro economics?\nWhere is sociology?",
        "Likes": 0
    },
    {
        "idx": 282,
        "Username": "vonhanno",
        "Comment": "While math wasn't my strongest subject, it was my passion for art that kept me engaged in school. The creativity and expression it offered provided the balance I needed to navigate my academic journey. And Bill, your continuous drive and innovation have always been a source of inspiration🙌",
        "Likes": 1
    },
    {
        "idx": 283,
        "Username": "stephanie-jensen-07b18328",
        "Comment": "History because I was horrible at memorizing names, dates and places. Now that I’m much older I want to learn that info.",
        "Likes": 1
    },
    {
        "idx": 284,
        "Username": "ray-lotfi-03a4b9126",
        "Comment": "When your poll is closed can you mention your least like subject Bill Gate also. Being computer/Electrical major (your time computer was part of EE) it shouldn't be Math ❤️ ",
        "Likes": 0
    },
    {
        "idx": 285,
        "Username": "aasma-naz-16644928a",
        "Comment": "Math,English, Science ",
        "Likes": 0
    },
    {
        "idx": 286,
        "Username": "dorinionescu",
        "Comment": "FirstIn2TopNeverOut  = You can not organize feelings and love by the title and numbers. The first one should be the one that inspires you the most this week; the second one is the former Number One.  It is a FirstIn2TopNeverOut stack principle. 😍 \nLike this playlist\nhttps://www.youtube.com/playlist?list=PL9rGXY173aFoUA1CY2jSpen7a2cU41MKH",
        "Likes": 0
    },
    {
        "idx": 287,
        "Username": "terra-turner-cherrycobiz",
        "Comment": "Math makes sense, science is interesting, history is foundational, and English is an experience.",
        "Likes": 1
    },
    {
        "idx": 288,
        "Username": "sarwar-siddiqui",
        "Comment": "Chemistry ",
        "Likes": 1
    },
    {
        "idx": 289,
        "Username": "alberto-calabrese-56bb36181",
        "Comment": "Honestly I didn't have least favourite subjects, but least favourite teachers.\nI used to like math when I was 11/12 because I had a competent and passionate teacher. Hated it in high-school.",
        "Likes": 0
    },
    {
        "idx": 290,
        "Username": "eduardo-jesús-chávez-sanhueza",
        "Comment": "I like science.",
        "Likes": 0
    },
    {
        "idx": 291,
        "Username": "petevoss",
        "Comment": "Nice playlist here! Cash, Beatles, Marley! Even Elliott Smith! I feel you might like BoyGenius. Have you given them a listen?",
        "Likes": 0
    },
    {
        "idx": 292,
        "Username": "henrietta-szutorisz-phd-297a9727",
        "Comment": "Glad to see I'm far from alone not being a history buff. I even had the best history teacher in high school, but I'm just not interested in memorizing and reciting stuff that happened in the past. And the gym class that's not on the list. ",
        "Likes": 1
    },
    {
        "idx": 293,
        "Username": "iyabdullah",
        "Comment": "Yup, that explains a great deal. If people didn’t have their smartphones they couldn’t add a percentage to any amount and no knowledge about World history, never mind their own.",
        "Likes": 0
    },
    {
        "idx": 294,
        "Username": "anja-stiedl",
        "Comment": "Jokes on the topic:\n\nWhy is 6 afraid of 7? \nBecause 7 8 9!\n\nWhy did 7 eat 9?\nBecause someone said it should have 3 square meals a day.",
        "Likes": 0
    },
    {
        "idx": 295,
        "Username": "bob-goodfellow-721256",
        "Comment": "Those were my top 4 favorite classes!",
        "Likes": 1
    },
    {
        "idx": 296,
        "Username": "tinakontos",
        "Comment": "It really depended on the teacher.",
        "Likes": 0
    },
    {
        "idx": 297,
        "Username": "testpro",
        "Comment": "Sport and Music if I could add some ....",
        "Likes": 1
    },
    {
        "idx": 298,
        "Username": "cesarfernandezos",
        "Comment": "religion",
        "Likes": 1
    },
    {
        "idx": 299,
        "Username": "carolriser",
        "Comment": "Math, English, Science, History-no issues at all. Philosophy-that’s another story.",
        "Likes": 1
    },
    {
        "idx": 300,
        "Username": "krushnakumar-dundle-8850131b3",
        "Comment": "History 😍",
        "Likes": 1
    },
    {
        "idx": 301,
        "Username": "mark-jc-woods",
        "Comment": "I've come to realise that math is a language in and of itself - one can be good at 'languages' but appalling at math - it's the same with music: some people almost instinctively understand the language of music while others will never grasp its mysteries.\n",
        "Likes": 1
    },
    {
        "idx": 302,
        "Username": "deepak-kumar-t-a-1b378936",
        "Comment": "Biology",
        "Likes": 0
    },
    {
        "idx": 303,
        "Username": "sakshi-shekhar-a258a778",
        "Comment": "none of them :)",
        "Likes": 1
    },
    {
        "idx": 304,
        "Username": "alexey-navolokin-5420563",
        "Comment": "Adding math to my playlist? Now that's a new level of geek chic! Excited to indulge in some numbers and jams. Thanks for challenging my left brain, Bill!\"  ",
        "Likes": 0
    },
    {
        "idx": 305,
        "Username": "anja-stiedl",
        "Comment": "Do you have a playlist for those of us whose least favorite subject was English?\n-\nAnyway: nice idea!!!",
        "Likes": 0
    },
    {
        "idx": 306,
        "Username": "zarul-zaabah",
        "Comment": "I like all 4 actually. My least favourite subject would be Arts because i am very bad at it 😅",
        "Likes": 1
    },
    {
        "idx": 307,
        "Username": "rana-khezam-8b379515b",
        "Comment": "Chemistry lol",
        "Likes": 1
    },
    {
        "idx": 308,
        "Username": "edward-freedman-6917082",
        "Comment": "What if I like them all?",
        "Likes": 0
    },
    {
        "idx": 309,
        "Username": "tahir-ayaz-engr",
        "Comment": "Bill Gates is there an option ‘none of the above’ ???",
        "Likes": 0
    },
    {
        "idx": 310,
        "Username": "inam-ullah-",
        "Comment": "Haha, I'm sure this playlist can make math more enjoyable! Who knew numbers could be so fun?",
        "Likes": 0
    },
    {
        "idx": 311,
        "Username": "martin-cronk-394620a",
        "Comment": "I didn't go to that level of school 😐 so, I can't answer that question. ",
        "Likes": 1
    },
    {
        "idx": 312,
        "Username": "shlomit-benoish-ab45b91a",
        "Comment": "A week later it’s coming to my feed. People need to learn values .\nI don’t know how to get your help but it’s urgent 🚨 . I wish someone could help me get your attention a year or two ago.",
        "Likes": 0
    },
    {
        "idx": 313,
        "Username": "yolanda-semper-3354571aa",
        "Comment": "It was History and French!",
        "Likes": 1
    },
    {
        "idx": 314,
        "Username": "virginbernardus52",
        "Comment": "Love Science but not Biology 🥲",
        "Likes": 1
    },
    {
        "idx": 315,
        "Username": "magdalenakulisz",
        "Comment": "I would look at it from a different point of view and choose English. Why? \n\nIf we all had a good command and understanding of English then understanding the Science, Math or History wouldn’t be a burden or hard. \n\nWho is with me?",
        "Likes": 0
    },
    {
        "idx": 316,
        "Username": "carlos-morillo-merino-5b767043",
        "Comment": "Mis dieses Bill, una muy buena lista de música. Para cuando una con los colores? O con fruta? Bueno en esta última no que podría salir apple",
        "Likes": 1
    },
    {
        "idx": 317,
        "Username": "טליה-פדלון-494741294",
        "Comment": "Bill I want offer for you sometime please send me massage. ",
        "Likes": 1
    },
    {
        "idx": 318,
        "Username": "vikash-mohanta-48259a132",
        "Comment": "Geography ",
        "Likes": 1
    },
    {
        "idx": 319,
        "Username": "jeremy-stoker-4b624640",
        "Comment": "Physics! Beyond my comprehension..🤪",
        "Likes": 1
    },
    {
        "idx": 320,
        "Username": "carmina-oliveira-1a116270",
        "Comment": "Latin",
        "Likes": 1
    },
    {
        "idx": 321,
        "Username": "habitationprestige1",
        "Comment": "Thank you 🙏 I liked it 😃",
        "Likes": 1
    },
    {
        "idx": 322,
        "Username": "tylercowie",
        "Comment": "Geography",
        "Likes": 1
    },
    {
        "idx": 323,
        "Username": "iris-welcome-a6645876",
        "Comment": "Hated Maths especially Algebra.😂",
        "Likes": 1
    },
    {
        "idx": 324,
        "Username": "xiaolianyuan",
        "Comment": "There were two reasons that made me dislike history class. One was the poor and boring teaching in the class, and the other was my difficulty in reading texts. Interestingly, nowadays, I find myself increasingly interested in learning about history.",
        "Likes": 0
    },
    {
        "idx": 325,
        "Username": "dirk-boninsegna-🇺🇦-0070291b7",
        "Comment": "I liked all 4!!!!",
        "Likes": 0
    },
    {
        "idx": 326,
        "Username": "immanuel-maruli-tua-pardede",
        "Comment": "History. Because it's not limited to just facts; there are various interpretations or versions of historical events, which can be confusing when trying to determine which one is accurate or should be believed.",
        "Likes": 3
    },
    {
        "idx": 327,
        "Username": "brianljantzi",
        "Comment": "These were all my favourites",
        "Likes": 0
    },
    {
        "idx": 328,
        "Username": "julio-soliz-ch",
        "Comment": "I used to love all...",
        "Likes": 0
    },
    {
        "idx": 329,
        "Username": "joshuagaspar",
        "Comment": "Jeffrey Epstein ",
        "Likes": 0
    },
    {
        "idx": 330,
        "Username": "barning-maxwell-evans-479ba991",
        "Comment": "The teaching was too rigid. It was not fun!",
        "Likes": 1
    },
    {
        "idx": 331,
        "Username": "da-wang-b4573bba",
        "Comment": "Class",
        "Likes": 0
    },
    {
        "idx": 332,
        "Username": "sagor-shikder-566b2619a",
        "Comment": "https://10ms.io/8okWv2",
        "Likes": 1
    },
    {
        "idx": 333,
        "Username": "benjamin-conant-91b58b152",
        "Comment": "Drafting was my favorite part but math. Oh god.\n",
        "Likes": 0
    },
    {
        "idx": 334,
        "Username": "srdjanlukic",
        "Comment": "99 Luftballons https://g.co/kgs/HKR5pJ",
        "Likes": 0
    },
    {
        "idx": 335,
        "Username": "veronique-heyes-5b456227",
        "Comment": "I liked all these! Took an excellent math teacher to give me the passion for numbers though. Before that I was somewhat lost with maths.",
        "Likes": 0
    },
    {
        "idx": 336,
        "Username": "garba-muhammad-3a55171a3",
        "Comment": "Geography and Agriculture as my best subjects in secondary school ",
        "Likes": 1
    },
    {
        "idx": 337,
        "Username": "stephenbielby",
        "Comment": "Math? You mean Maths Bill Gates  😂🇬🇧",
        "Likes": 0
    },
    {
        "idx": 338,
        "Username": "sagark974",
        "Comment": "Thanks for sharing! I'm looking forward to checking out your 'By the Numbers' Spotify playlist. Math and music make a great combination!",
        "Likes": 0
    },
    {
        "idx": 339,
        "Username": "alicia-murillo-764499205",
        "Comment": "Mi primera materia fue ciencias y la segunda inglés ",
        "Likes": 0
    },
    {
        "idx": 340,
        "Username": "raymonde-fischer-043709b6",
        "Comment": "And geometry but  in Roumania comunisdtit  iwas jew and   after  in Israel  I had no money for nothing.... 😢",
        "Likes": 1
    },
    {
        "idx": 341,
        "Username": "angela-bayat-6894002",
        "Comment": "Geography",
        "Likes": 1
    },
    {
        "idx": 342,
        "Username": "jack-van-69078023",
        "Comment": "Numbers don’t lie and I have the numbers to completely restructure homeowners insurance in the US and save on premiums and insure all claims and eliminate FEMA and Flood additional policies \nI need an organization like yours that the public trust and has the audience at it’s command. The fee for managing my fund is in the billions of dollars!\nRespectfully,\nJack Van\njackv607@gmail.com",
        "Likes": 1
    },
    {
        "idx": 343,
        "Username": "duc-long-p-a87159a8",
        "Comment": "Can I use 'Ctrl' 😁 the best and most important subject to me is sport and health education. I look up to healthy long-term people who have both great mental and physical.",
        "Likes": 0
    },
    {
        "idx": 344,
        "Username": "thejoshmoore",
        "Comment": "Does it cover Euclidean geometry, or just the modern stuff?",
        "Likes": 1
    },
    {
        "idx": 345,
        "Username": "alpaslan-şamlıoğlu-07804424",
        "Comment": "Stop your fucking mosquito programme you demon being.",
        "Likes": 1
    },
    {
        "idx": 346,
        "Username": "rotua-siahaan-43581a18a",
        "Comment": "History i love",
        "Likes": 1
    },
    {
        "idx": 347,
        "Username": "saniye-kaldirim-tax-lawyer-55196818",
        "Comment": "Nothing",
        "Likes": 1
    },
    {
        "idx": 348,
        "Username": "josef-hodek-4097b313",
        "Comment": "Knowing with a willingness to seek the truth. May the truth be with you.\n\nPoznání s ochotou hledat pravdu. Nechť tě pravda provází.",
        "Likes": 0
    },
    {
        "idx": 349,
        "Username": "ocodan",
        "Comment": "Organic Chemistry.",
        "Likes": 0
    },
    {
        "idx": 350,
        "Username": "venu-puthankattil-547968116",
        "Comment": "I loved English, Science, and Math (in that order). History was the least interesting subject in this list at the time but I have grown to appreciate it over the years. ",
        "Likes": 1
    },
    {
        "idx": 351,
        "Username": "peterjacob",
        "Comment": "Geeky 🎉🥳",
        "Likes": 0
    },
    {
        "idx": 352,
        "Username": "m-bouzeboudja",
        "Comment": "And You?",
        "Likes": 0
    },
    {
        "idx": 353,
        "Username": "munshi-masud-hossain-4642a840",
        "Comment": "English mostly use for communication.",
        "Likes": 0
    },
    {
        "idx": 354,
        "Username": "suellen-p-bettencourt-rodeia-160b77283",
        "Comment": "History as one of the most voted. I'm not surprised. This explains why, in different ways and in other areas, we continue to make the same mistakes.",
        "Likes": 0
    },
    {
        "idx": 355,
        "Username": "papis-diallo-2a56aa252",
        "Comment": "All these subjects have a History.",
        "Likes": 1
    },
    {
        "idx": 356,
        "Username": "paula-ham-su-11988312",
        "Comment": "“P.E.” \nI don’t see that on the list 😄",
        "Likes": 0
    },
    {
        "idx": 357,
        "Username": "tanja-attermeyer-094b13103",
        "Comment": "Love the playlist! Ending with infinity is the icing.",
        "Likes": 0
    },
    {
        "idx": 358,
        "Username": "granthliu",
        "Comment": "English. Handily.",
        "Likes": 0
    },
    {
        "idx": 359,
        "Username": "passiveelectroniccomponents",
        "Comment": "We studied math for decades but in the end it was =sum($/g$27). Who knew?",
        "Likes": 0
    },
    {
        "idx": 360,
        "Username": "sse-caleb-martin",
        "Comment": "love memory",
        "Likes": 0
    },
    {
        "idx": 361,
        "Username": "richard-james-56877a54",
        "Comment": "💩💩💩",
        "Likes": 0
    },
    {
        "idx": 362,
        "Username": "dariuszbinczyk",
        "Comment": "Sport …..",
        "Likes": 1
    },
    {
        "idx": 363,
        "Username": "vilma-hanske-b5a091103",
        "Comment": "When I was in the school I don’t took care of any history… past is past… I thought…today I feel that the history is very essential and fundamental for our future development and understanding for this time and life.",
        "Likes": 1
    },
    {
        "idx": 364,
        "Username": "bloecker",
        "Comment": "Bill Gates In fact English and Math.",
        "Likes": 0
    },
    {
        "idx": 365,
        "Username": "lisammar10",
        "Comment": "History, it was a huge book and anything I asked about to my family was disputed.  It wasn't culturally relevant.  ",
        "Likes": 0
    },
    {
        "idx": 366,
        "Username": "loreto-carranza-80147627",
        "Comment": "Great playlist, BTW! Music to learn math helped me get some concepts  with mnemonics when I was a kid",
        "Likes": 0
    },
    {
        "idx": 367,
        "Username": "mayur-choudhary-876379266",
        "Comment": "I like math but i am not that good in it 🤔🙇🏻",
        "Likes": 1
    },
    {
        "idx": 368,
        "Username": "fadyybarakat",
        "Comment": "It is all in the way these subjects are presented. Learning methods are key. Any topic could become favorable then. ",
        "Likes": 0
    },
    {
        "idx": 369,
        "Username": "fabriciobarancelli",
        "Comment": "Geography, science, history and math were the best. All of them actually. I miss it a little bit. The life was easier 😂",
        "Likes": 0
    },
    {
        "idx": 370,
        "Username": "liesellaas",
        "Comment": "I loved Math & Science",
        "Likes": 0
    },
    {
        "idx": 371,
        "Username": "eduards-kuskoveckis-danilovs-b6505b21",
        "Comment": "PC games:)",
        "Likes": 0
    },
    {
        "idx": 372,
        "Username": "cesar-bonilla-a3ba92164",
        "Comment": "Math is the language of a genius.",
        "Likes": 1
    },
    {
        "idx": 373,
        "Username": "claychaffin",
        "Comment": "Content Marketing: Surveys",
        "Likes": 1
    },
    {
        "idx": 374,
        "Username": "oleksandr-levchenko-dvxdxv",
        "Comment": "Geography, that's why I love travels so much",
        "Likes": 1
    },
    {
        "idx": 375,
        "Username": "mansour-sharifi-17a57b11",
        "Comment": "None of the above really!",
        "Likes": 0
    },
    {
        "idx": 376,
        "Username": "hariramachandra",
        "Comment": "How can math be the \"least favorite\" for anyone ? ",
        "Likes": 0
    },
    {
        "idx": 377,
        "Username": "x-y-a97ba1269",
        "Comment": "None of them, all are essential, but we need to compress the knowledge more and increase the learning speed.",
        "Likes": 0
    },
    {
        "idx": 378,
        "Username": "poojaa-dhanaraj-065b6b19a",
        "Comment": "I like everything 😝",
        "Likes": 0
    },
    {
        "idx": 379,
        "Username": "raedmalexanderayyad",
        "Comment": "I loved them all! 😉",
        "Likes": 0
    },
    {
        "idx": 380,
        "Username": "ramil-mamedoff-03788117a",
        "Comment": "Math is a key for other subjects in my opinion. ",
        "Likes": 1
    },
    {
        "idx": 381,
        "Username": "shahjoynob",
        "Comment": "Even though History was my least favourite, I was always reading about history outside of class through novels. This, I found created a richer and more memorable experience.",
        "Likes": 0
    },
    {
        "idx": 382,
        "Username": "lena-espinoza-foley-b8174428",
        "Comment": "What was your least favorite?",
        "Likes": 0
    },
    {
        "idx": 383,
        "Username": "arunjit-saha-vox-agencies-pvt-ltd-7297393a",
        "Comment": "Time teaches us subjects...all I remember geography was my fav bcoz of the colorful spectacular images displayed in that book.and a sense of globe travelling.",
        "Likes": 0
    },
    {
        "idx": 384,
        "Username": "writer1712",
        "Comment": "Economics",
        "Likes": 1
    },
    {
        "idx": 385,
        "Username": "maria-trikogia-b44a1359",
        "Comment": "I had no least favorite, I liked all my courses especially mathematics!!!!!!",
        "Likes": 0
    },
    {
        "idx": 386,
        "Username": "ray-lotfi-03a4b9126",
        "Comment": "Interesting, who care for language (English) unless one has language as major. Nothing is more challenging, interesting and challenge one than Math",
        "Likes": 1
    },
    {
        "idx": 387,
        "Username": "saharisharshad",
        "Comment": "None, I loved them all! I didn’t like my chemistry teacher but I loved experimenting in the lab. In college I hated math and physics. In school I loved everything.",
        "Likes": 1
    },
    {
        "idx": 388,
        "Username": "טליה-פדלון-494741294",
        "Comment": "I'm waiting for you bill ",
        "Likes": 1
    },
    {
        "idx": 389,
        "Username": "matthewlenzini",
        "Comment": "Well curated…!",
        "Likes": 0
    },
    {
        "idx": 390,
        "Username": "helge-hersbøll",
        "Comment": "Remember, that the human brain is not build for history; it doesn’t care",
        "Likes": 0
    },
    {
        "idx": 391,
        "Username": "shermarianmanrowe",
        "Comment": "Spanish ",
        "Likes": 1
    },
    {
        "idx": 392,
        "Username": "faghfourmaghrebi",
        "Comment": "I suggest listening to PPM - Resurrection track from youtube. Somehow that music track to me seems like the perfect balance of mathematics and art.",
        "Likes": 0
    },
    {
        "idx": 393,
        "Username": "rabihjreish",
        "Comment": "All were my favorite, but i exceled in math ( geometry , algebra , calculas and trigonometry) and sciences( biology ,physics, chemistry)",
        "Likes": 0
    },
    {
        "idx": 394,
        "Username": "stephaniewharris",
        "Comment": "It wouldn’t have been complete without Spoon!",
        "Likes": 0
    },
    {
        "idx": 395,
        "Username": "gisele-frasson-🇧🇷-653627128",
        "Comment": "History! I love studying history. 😉 \nBill Gates ",
        "Likes": 0
    },
    {
        "idx": 396,
        "Username": "adamlovesu",
        "Comment": "Thanks Mr Gates for the lunch and dinner,",
        "Likes": 0
    },
    {
        "idx": 397,
        "Username": "jennifer-hetherington-family-law-mediator-and-collaborative-lawyer",
        "Comment": "Why is 500 Miles not on this list??? ",
        "Likes": 0
    },
    {
        "idx": 398,
        "Username": "dominique-w-54165abb",
        "Comment": "Like them all.. It wasn't the subject; it was the teachers.",
        "Likes": 0
    },
    {
        "idx": 399,
        "Username": "davidmichaelrivers",
        "Comment": "Nice one Bill Gates",
        "Likes": 0
    },
    {
        "idx": 400,
        "Username": "shawon-dedicated",
        "Comment": "Well, from my side, I think math is little bit boring.But, it's become interesting when you solve a problem.",
        "Likes": 0
    },
    {
        "idx": 401,
        "Username": "maggies-magnificent-scents",
        "Comment": "My Associate Degree major is Contemporary Management. I'm going to need math for it.",
        "Likes": 1
    },
    {
        "idx": 402,
        "Username": "elizabeth-liz-gichora-2a59b021",
        "Comment": "Used to be Math.",
        "Likes": 0
    },
    {
        "idx": 403,
        "Username": "heatherraewatkins",
        "Comment": "PE was mine 😂 ",
        "Likes": 0
    },
    {
        "idx": 404,
        "Username": "gabriel-marcon-97133b158",
        "Comment": "None of them, I love Geography",
        "Likes": 0
    },
    {
        "idx": 405,
        "Username": "roy-oomen-253b96167",
        "Comment": "I liked them all. Some came easier than others but probably liked the harder ones the most , it's about learning ... all throughout ones' life\n\nI liked history the most by a lot",
        "Likes": 1
    },
    {
        "idx": 406,
        "Username": "hemantmital",
        "Comment": "Loved your playlist Bill Gates 😍",
        "Likes": 0
    },
    {
        "idx": 407,
        "Username": "hkhafagi",
        "Comment": "Loved math and became a programmer 🥰 .. \nshout outs for all developers and engineers ..",
        "Likes": 0
    },
    {
        "idx": 408,
        "Username": "vickyg416",
        "Comment": "Math was my favorite subject. I get A's and have taken advanced classes. Meanwhile English was my least favorite. All of the vocab and writing was not for me.",
        "Likes": 0
    },
    {
        "idx": 409,
        "Username": "ali-moghadam-1b919b101",
        "Comment": "Math was my arch enemy in school always 😵‍💫",
        "Likes": 1
    },
    {
        "idx": 410,
        "Username": "hamed-rahmati-7437b382",
        "Comment": "The English was boring since the English teachers were boring",
        "Likes": 1
    },
    {
        "idx": 411,
        "Username": "joshy-lazar-a2814933",
        "Comment": "A Building never stands with a Stone, it supports many materials and effort, same for Human development.",
        "Likes": 0
    },
    {
        "idx": 412,
        "Username": "mohammadabuzaid",
        "Comment": "Hi Bill Gates  what’s your position about what happens in palestine and gaza , you are influencer and you should stand with the human rights and support palestine’nin",
        "Likes": 0
    },
    {
        "idx": 413,
        "Username": "brian-salter-14118911",
        "Comment": "Sadly, math is often taught by unenthusiastic teachers who have no idea how to integrate (Pun intended) the concepts. I used to think a multimedia approach would cure that problem, but nooo.",
        "Likes": 1
    },
    {
        "idx": 414,
        "Username": "manuel-keller-",
        "Comment": "its french, by faaaar",
        "Likes": 0
    },
    {
        "idx": 415,
        "Username": "kathy-reece-7431ba130",
        "Comment": "Bill, I was the only girl in my Geometry, Trigonometry,  and Calculus class. And we didn't get College Credit either!😮🤗🐦🦋❣",
        "Likes": 1
    },
    {
        "idx": 416,
        "Username": "pascalcrozet",
        "Comment": "Both maths and history are science ",
        "Likes": 0
    },
    {
        "idx": 417,
        "Username": "emanuele-giordano-a46a7ab0",
        "Comment": "I like very much mathematic formulas. I enjoy me with these. I like also science. ",
        "Likes": 0
    },
    {
        "idx": 418,
        "Username": "ralph-jonasson-a6660135",
        "Comment": "Phys Ed. I dropped it as soon as i could.",
        "Likes": 1
    },
    {
        "idx": 419,
        "Username": "commandantekaustav",
        "Comment": "I used to enjoy all of them.\n\nGeography, Biology and Sanskrit were something which I hated to the core. 😂",
        "Likes": 0
    },
    {
        "idx": 420,
        "Username": "constantino-alberto-588056227",
        "Comment": "None of these options. Which lead to a conundrum when it came time for college. I've chosen to pursue sciences, though.",
        "Likes": 1
    },
    {
        "idx": 421,
        "Username": "lena-al-rahbany-78875912",
        "Comment": "depends on the teacher, he either makes you fall in love with a subject, or hate it",
        "Likes": 0
    },
    {
        "idx": 422,
        "Username": "studioomega",
        "Comment": "None of the above. Geography, astronomy.",
        "Likes": 0
    },
    {
        "idx": 423,
        "Username": "sandra-bellemare-peng-a893b1",
        "Comment": "99 Luftballoons should be added 😁 \n",
        "Likes": 1
    },
    {
        "idx": 424,
        "Username": "nate-lechner-2b1443142",
        "Comment": "Bill Gates  pretty incredible but I hated math in school, after I graduated I found myself liking it more and more. Now I actually use math regularly and excel at the subject. Weird how life works out!",
        "Likes": 1
    },
    {
        "idx": 425,
        "Username": "topsecretuser",
        "Comment": "My teachers and professors made their best so I find myself guilty to answer that specially after turning myself a professor too 😂, everything was great, wink wink...",
        "Likes": 1
    },
    {
        "idx": 426,
        "Username": "tyler-klenow",
        "Comment": "As a true nerd, I have to say I liked all of them.",
        "Likes": 0
    },
    {
        "idx": 427,
        "Username": "karin-marie-lundgren-born-andersson-70945128a",
        "Comment": "Math is simular to Mother in russian",
        "Likes": 0
    },
    {
        "idx": 428,
        "Username": "cliff",
        "Comment": "Bill, this is crazy. These were my favorite subjects. Trying to pick is like that meme with the two buttons and the sweaty forehead. I don’t want to throw any of these under the bus!",
        "Likes": 1
    },
    {
        "idx": 429,
        "Username": "pedarla-srinivas-68678130",
        "Comment": "Mostly Science and Hindi",
        "Likes": 2
    },
    {
        "idx": 430,
        "Username": "rachelisrael9",
        "Comment": "definitely math! lol\n",
        "Likes": 1
    },
    {
        "idx": 431,
        "Username": "ivan-kwok-keung-lai",
        "Comment": "My favorite subjects are math and history, but if I had to pick one, I would pick history.",
        "Likes": 0
    },
    {
        "idx": 432,
        "Username": "steve-thielman-74a9852a",
        "Comment": "History, but I love learning history now.",
        "Likes": 1
    },
    {
        "idx": 433,
        "Username": "dpanizza",
        "Comment": "Math... because there is only 1 correct answer when it comes to math.",
        "Likes": 0
    },
    {
        "idx": 434,
        "Username": "jayashree-krishnaswamy-venuopala-16baa516",
        "Comment": "This is cool",
        "Likes": 1
    },
    {
        "idx": 435,
        "Username": "sartikahasirman",
        "Comment": "Look Bill I like nature science but if I have to choose, I love social science better 😁 I thrive at it.",
        "Likes": 0
    },
    {
        "idx": 436,
        "Username": "imre-kovacs-ba8462a2",
        "Comment": "I love Math, I can’t learn English, My course was science, but I love history. So I don’t know.",
        "Likes": 1
    },
    {
        "idx": 437,
        "Username": "jackie-rosenbaum-a3668535",
        "Comment": "You got it both right! Both my worst subjects. ",
        "Likes": 1
    },
    {
        "idx": 438,
        "Username": "mate-efraim-kovacs",
        "Comment": "Art 😂",
        "Likes": 0
    },
    {
        "idx": 439,
        "Username": "behrad-shapourzadeh-a880aa102",
        "Comment": "all of the above",
        "Likes": 1
    },
    {
        "idx": 440,
        "Username": "awsic",
        "Comment": "New math, helping my kids with their homework. Love all these subjects as they were originally taught. Math didn’t need to be reinvented just to sell more text books and vex mom and dad.",
        "Likes": 1
    },
    {
        "idx": 441,
        "Username": "ivo-kornel",
        "Comment": "You need to be investigated for crimes against humanity!",
        "Likes": 2
    },
    {
        "idx": 442,
        "Username": "paul-sichau-b3918b23",
        "Comment": "Loved them all",
        "Likes": 0
    },
    {
        "idx": 443,
        "Username": "cristina-sanz-8b0ab323",
        "Comment": "English as a second language",
        "Likes": 1
    },
    {
        "idx": 444,
        "Username": "michael-longo-cpa-a255b258",
        "Comment": "History, and now it’s one of my favorite subjects to read up on.",
        "Likes": 0
    },
    {
        "idx": 445,
        "Username": "bhopal-singh-69b4b384",
        "Comment": "If least favourite subject is math it means that their top floor is empty or full of rubbish.",
        "Likes": 0
    },
    {
        "idx": 446,
        "Username": "😃marc-biggelaar-a648b31a6",
        "Comment": "Lunch",
        "Likes": 6
    },
    {
        "idx": 447,
        "Username": "patrickblachutta",
        "Comment": "if i have to choose between those four, then it was Math\nbut in fact, my least favorite subject overall was Religion (leaving the fact, that my teacher taught me to play poker, aside)",
        "Likes": 1
    },
    {
        "idx": 448,
        "Username": "jameskbray",
        "Comment": "Nice inclusion of Built To Spill :)",
        "Likes": 0
    },
    {
        "idx": 449,
        "Username": "nancy-brisson-2a619785",
        "Comment": "Math was hardest. I don’t think in numbers. I am attuned to words.",
        "Likes": 0
    },
    {
        "idx": 450,
        "Username": "navdeep-r-389301b2",
        "Comment": "I came top in the year for all these subjects: took Maths and English 1 year early too. Taught by hippies ",
        "Likes": 0
    },
    {
        "idx": 451,
        "Username": "ashu-sood-64107823",
        "Comment": "It was depending on the teacher... history teacher was very boring....lol",
        "Likes": 0
    },
    {
        "idx": 452,
        "Username": "emilrijcken",
        "Comment": "I miss the song ‘Push it to the limit’ by Paul Engemann",
        "Likes": 0
    },
    {
        "idx": 453,
        "Username": "mahmood-abuidrees-888720a5",
        "Comment": "Math 100% all the others listed were my favourite actually ",
        "Likes": 0
    },
    {
        "idx": 454,
        "Username": "leanna-rose-45544980",
        "Comment": "Math is the best. How can anyone say that about math?!?",
        "Likes": 1
    },
    {
        "idx": 455,
        "Username": "it-erik",
        "Comment": "I loved all of them. :-)",
        "Likes": 0
    },
    {
        "idx": 456,
        "Username": "msansbury",
        "Comment": "Math - LOL! My university \"back in the day\" let us sub Computer Science for Math. That's what started me on this technology journey",
        "Likes": 1
    },
    {
        "idx": 457,
        "Username": "mark2122us-louw-phd-eng-718b42",
        "Comment": "everybody loves science",
        "Likes": 1
    },
    {
        "idx": 458,
        "Username": "a-isha-umar-a223a2224",
        "Comment": "I did not see this poll pop up on my timeline. It's science for me, specifically OChem.",
        "Likes": 0
    },
    {
        "idx": 459,
        "Username": "joão-mp-ferreira",
        "Comment": "Bill Gates, it was initially, but I ended up becoming an engineer. Math is like music.",
        "Likes": 0
    },
    {
        "idx": 460,
        "Username": "melvin-s-383320109",
        "Comment": "I would say the whole system that taught individuals to become industry robots competing for higher grades rather than being innovators. ",
        "Likes": 1
    },
    {
        "idx": 461,
        "Username": "tiagobrignol",
        "Comment": "I always loved history and science (geography too ❤️), but you got me on math 🥲... gonna try this playlist for sure. Thx 🙏",
        "Likes": 1
    },
    {
        "idx": 462,
        "Username": "diana-kirck",
        "Comment": "math equals meditation. but good teachers were rare to find.",
        "Likes": 0
    },
    {
        "idx": 463,
        "Username": "ramon-reyes-5901636",
        "Comment": "Chemistry",
        "Likes": 1
    },
    {
        "idx": 464,
        "Username": "meghankcombs",
        "Comment": "Depended on the year and the teacher for me! I’ve loved and hated all of these subjects at some point in time during school 😂",
        "Likes": 1
    },
    {
        "idx": 465,
        "Username": "kiranchavan",
        "Comment": "Everyone is trying to impress Bill, as if he is going to read all messages including mine 😃😃😃😃😃😃😃😂😂😂 🥃🥃🥃",
        "Likes": 1
    },
    {
        "idx": 466,
        "Username": "mikescarpiello",
        "Comment": "History is just rote memorization. Not sure how people could hate on it.",
        "Likes": 0
    },
    {
        "idx": 467,
        "Username": "h4r1kr15hn4n",
        "Comment": "If you read History in Indian school text 📚 books, will suicide immediately. Full of disgusting Stories of foolish Mughals and their blunders and creepy datas as well as glorifying invaders. ",
        "Likes": 1
    },
    {
        "idx": 468,
        "Username": "paulreedaust",
        "Comment": "I hated English. Everything else I was able to just apply simple logic or memory too. English always required a level of creativity I didnt have as a kid so I struggled with it.",
        "Likes": 1
    },
    {
        "idx": 469,
        "Username": "sergiotellez",
        "Comment": "Chemistry and my life have been surrounded by it!!!",
        "Likes": 1
    },
    {
        "idx": 470,
        "Username": "franklin1",
        "Comment": "I love history. But it does not generate income.",
        "Likes": 0
    },
    {
        "idx": 471,
        "Username": "jonathanpepperdelphos",
        "Comment": "History, but only because the teacher was aweful.",
        "Likes": 0
    },
    {
        "idx": 472,
        "Username": "johnmarkpalacios",
        "Comment": "I put Science since Biology might be my least favorite, but \"science\" is too broad. In general these were all my favorite subjects. Ok, school was my favorite.",
        "Likes": 1
    },
    {
        "idx": 473,
        "Username": "ismaildurgut",
        "Comment": "music and arts i had bad marks on them real mess ",
        "Likes": 0
    },
    {
        "idx": 474,
        "Username": "md-hasanuzzaman46",
        "Comment": "I always love math. ",
        "Likes": 0
    },
    {
        "idx": 475,
        "Username": "lex-barcov-5425b5259",
        "Comment": "I believe it's not about the subject, but the teacher. I've had the most crooked history teacher ever who would only give you an A for a certain amount 💰💵🪙 But I do love history ❤️",
        "Likes": 1
    },
    {
        "idx": 476,
        "Username": "md-abubakar-siddiq-kamaluddin-2623344",
        "Comment": "I loved all my subjects..my teachers were all great",
        "Likes": 0
    },
    {
        "idx": 477,
        "Username": "brandon-m-keenan-4a382211",
        "Comment": "I wonder what he means by this",
        "Likes": 0
    },
    {
        "idx": 478,
        "Username": "falguni--sharma",
        "Comment": "Hey Bill Gates! Math has always been my jam too 🤓! This Spotify list is pure gold 🎵. Thanks for sharing the musical vibes! 🎶",
        "Likes": 1
    },
    {
        "idx": 479,
        "Username": "ibgarrett",
        "Comment": "I answered math because there wasn’t a “yes” option for all of them. :). Oddly enough as I got older I appreciated them much more.",
        "Likes": 4
    },
    {
        "idx": 480,
        "Username": "biscaichim",
        "Comment": "Good article, thorough analysis and very contagious",
        "Likes": 0
    },
    {
        "idx": 481,
        "Username": "dr-soniya-sinha-6643b942",
        "Comment": "People here gonna need it, really.. ",
        "Likes": 0
    },
    {
        "idx": 482,
        "Username": "mszlezak",
        "Comment": "Information technology and playing Quake on LAN :D",
        "Likes": 1
    },
    {
        "idx": 483,
        "Username": "michelbakkercom",
        "Comment": "German, French. I'm terrible at languages. No wonder I'm great at programming languages since I was 11. Started with 50 keywords and I could express everything I wanted. ",
        "Likes": 1
    },
    {
        "idx": 484,
        "Username": "pete-tims-7aa994110",
        "Comment": "School",
        "Likes": 1
    },
    {
        "idx": 485,
        "Username": "guadalupe-jo-laskey-4b928621a",
        "Comment": "My least favorite subject was the one where the teacher would not make his teachings interesting.\n",
        "Likes": 2
    },
    {
        "idx": 486,
        "Username": "leslierovetti",
        "Comment": "It always depended on the teacher.",
        "Likes": 1
    },
    {
        "idx": 487,
        "Username": "maxine-millard-707ab2132",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 488,
        "Username": "abraham-hayrapetyan",
        "Comment": "English, because it wasn't part of my formal curriculum, but I had a strong desire to learn it 😂 ",
        "Likes": 1
    },
    {
        "idx": 489,
        "Username": "laura-tabellini-pierre",
        "Comment": "Math bored me to death in high school. Then I ended up in STEM where I studied math and statistics. And I loved it.",
        "Likes": 1
    },
    {
        "idx": 490,
        "Username": "kevinrice1163",
        "Comment": "Financial literacy! … oh, wait..",
        "Likes": 1
    },
    {
        "idx": 491,
        "Username": "dumas-michel-loury-648817206",
        "Comment": "Good😊",
        "Likes": 2
    },
    {
        "idx": 492,
        "Username": "dr-anjali-nevrekar-750017102",
        "Comment": "I used to love maths. Used to say tables from. 2 to 30 every day evening.",
        "Likes": 1
    },
    {
        "idx": 493,
        "Username": "thomasanden",
        "Comment": "Chemistry\n",
        "Likes": 1
    },
    {
        "idx": 494,
        "Username": "mary-ann-dizon-ba336436",
        "Comment": "P.E.",
        "Likes": 0
    },
    {
        "idx": 495,
        "Username": "elias-miguel-vernieri",
        "Comment": "my least favorite subject in school was  History.. and i love history.. i just hate how its teached. \n",
        "Likes": 1
    },
    {
        "idx": 496,
        "Username": "cianaatech",
        "Comment": "All of these",
        "Likes": 1
    },
    {
        "idx": 497,
        "Username": "zacharia-mwanuke",
        "Comment": "Wow interesting Bill Gates, I hated Math not just I wasn't able to performed but due to my math Teacher he used to bring home work often.",
        "Likes": 1
    },
    {
        "idx": 498,
        "Username": "pereklis-perri-theodorlis-31019625a",
        "Comment": "Maths",
        "Likes": 0
    },
    {
        "idx": 499,
        "Username": "craig-r-gordon-1a66aa78",
        "Comment": "Math",
        "Likes": 0
    },
    {
        "idx": 500,
        "Username": "david-hartzog-a6a72a44",
        "Comment": "School only teaches you what “they “ want you to believe.",
        "Likes": 1
    },
    {
        "idx": 501,
        "Username": "mindforge-nm",
        "Comment": "Hey Bill, I can’t really say I had any least favorite subject in school, but I struggled more in English than all the others.",
        "Likes": 1
    },
    {
        "idx": 502,
        "Username": "quinton-bemiller-ed-d-b2741656",
        "Comment": "Um, I don’t see P.E. as an option here!",
        "Likes": 1
    },
    {
        "idx": 503,
        "Username": "kurt-dutt-b158638",
        "Comment": "PE",
        "Likes": 1
    },
    {
        "idx": 504,
        "Username": "srinivasbdaram",
        "Comment": "Loved all the courses and top in the class and used to teach friends which helped me a  lot ",
        "Likes": 1
    },
    {
        "idx": 505,
        "Username": "jackdavidson717",
        "Comment": "Microsoft",
        "Likes": 1
    },
    {
        "idx": 506,
        "Username": "nikolajlaustsen",
        "Comment": "Of the four possible answers I have to choose English even though I liked this, my answer would have been sports or danish.",
        "Likes": 1
    },
    {
        "idx": 507,
        "Username": "faisal-nyberg-6b26911a4",
        "Comment": "History ",
        "Likes": 1
    },
    {
        "idx": 508,
        "Username": "williammai",
        "Comment": "The thing we learned from history is that human never learn from their mistakes.",
        "Likes": 1
    },
    {
        "idx": 509,
        "Username": "valerie-brauer-tremblay",
        "Comment": "Why no \"24\" song? Love the playlist!",
        "Likes": 2
    },
    {
        "idx": 510,
        "Username": "nicholasrenotte",
        "Comment": "English was definitely lowest on my list. Physics was the fav!",
        "Likes": 5
    },
    {
        "idx": 511,
        "Username": "jenna-morgan-5472931",
        "Comment": "How is science not on top? 👩‍🔬🔬🧬",
        "Likes": 1
    },
    {
        "idx": 512,
        "Username": "debra-a-porti-62741520",
        "Comment": "History is interesting but memorizing all those dates with no application other than memorizing.",
        "Likes": 3
    },
    {
        "idx": 513,
        "Username": "jimena-asorey",
        "Comment": "Geography",
        "Likes": 1
    },
    {
        "idx": 514,
        "Username": "drrobbscott",
        "Comment": "Woodworking",
        "Likes": 1
    },
    {
        "idx": 515,
        "Username": "pchan2021",
        "Comment": "None of the above.",
        "Likes": 1
    },
    {
        "idx": 516,
        "Username": "patrick-saah-827179244",
        "Comment": "Mathematics because I had to do my best to remember soo many theories, equations and formulas to solve many questions.",
        "Likes": 1
    },
    {
        "idx": 517,
        "Username": "diego-ordóñez-buitrón-3b9658174",
        "Comment": "All of them we're fun ! 🤟 ",
        "Likes": 1
    },
    {
        "idx": 518,
        "Username": "daniel-stith-61b5293",
        "Comment": "For me it was history. Not because I don't like the subject. The inaccuracies drove me more than a little bonkers.",
        "Likes": 1
    },
    {
        "idx": 519,
        "Username": "rexford-meade-56151587",
        "Comment": "The history taught was filled with lies",
        "Likes": 2
    },
    {
        "idx": 520,
        "Username": "olubukola-adebusuyi-50011b2b",
        "Comment": "None",
        "Likes": 0
    },
    {
        "idx": 521,
        "Username": "linda-katte-b35891206",
        "Comment": "Ofcourse history",
        "Likes": 1
    },
    {
        "idx": 522,
        "Username": "tom-houllahan-3842a749",
        "Comment": "World dominance by wealthy a holes was always my least favorite",
        "Likes": 1
    },
    {
        "idx": 523,
        "Username": "valdemar-mendonça-a5208a260",
        "Comment": "I liked and enjoy them all and as always in the study of this human life on earth, an eternal learner.",
        "Likes": 1
    },
    {
        "idx": 524,
        "Username": "todd-riley-aa5023222",
        "Comment": "Science but only because the Catholic school I attended did not offer many opportunities.",
        "Likes": 1
    },
    {
        "idx": 525,
        "Username": "daniel-uriona-88278323",
        "Comment": "Science, without knowledge there is no growth, medical science saves your only company. You.",
        "Likes": 1
    },
    {
        "idx": 526,
        "Username": "sarafaridi",
        "Comment": "Computers",
        "Likes": 1
    },
    {
        "idx": 527,
        "Username": "azadeh-ahkamiraad",
        "Comment": "My favorite was/is math 😍, and the playlist starts with Johnny Cash 🤩",
        "Likes": 1
    },
    {
        "idx": 528,
        "Username": "rahimaziz",
        "Comment": "Sains dan matematik",
        "Likes": 1
    },
    {
        "idx": 529,
        "Username": "worldwordwalker",
        "Comment": "Love&peace",
        "Likes": 1
    },
    {
        "idx": 530,
        "Username": "lettymolina",
        "Comment": "I enjoyed the subject matter for all of these, but not always the teacher 😀 ",
        "Likes": 1
    },
    {
        "idx": 531,
        "Username": "shahzaib1616",
        "Comment": "Chemistry, Urdu & Sindhi 🫣",
        "Likes": 1
    },
    {
        "idx": 532,
        "Username": "sailesh-sarathi-60a14a17",
        "Comment": "I am waiting for the most favourite subject in school next!",
        "Likes": 3
    },
    {
        "idx": 533,
        "Username": "designermarcelllo",
        "Comment": "simply review what you do... a great lesson ",
        "Likes": 1
    },
    {
        "idx": 534,
        "Username": "alenareva",
        "Comment": "How come PE is not on the list?",
        "Likes": 5
    },
    {
        "idx": 535,
        "Username": "othman-alshuhail-193b10110",
        "Comment": "AntiVaccines classes ",
        "Likes": 1
    },
    {
        "idx": 536,
        "Username": "mike-widdis-36232652",
        "Comment": "I loved math and COMPUTERS.",
        "Likes": 1
    },
    {
        "idx": 537,
        "Username": "هادی-احمدی-2a4966157",
        "Comment": "عشق\n#عشق",
        "Likes": 1
    },
    {
        "idx": 538,
        "Username": "cranestephenlandis",
        "Comment": "Math was definitely mine. But I went into Law instead. \n\nWe all can be gifted in different ways, after all.",
        "Likes": 1
    },
    {
        "idx": 539,
        "Username": "md-mahamudul-hossain-robin-47919a2b",
        "Comment": "Sad to see People hate Math .Mathe - My all time favorite subject is the same for my 9 years son ",
        "Likes": 1
    },
    {
        "idx": 540,
        "Username": "salman-ahmad-77ba8b11a",
        "Comment": "I hated history bec I loved maths. ",
        "Likes": 1
    },
    {
        "idx": 541,
        "Username": "dominick-ciaravino-890a321a9",
        "Comment": "They were all great!",
        "Likes": 1
    },
    {
        "idx": 542,
        "Username": "seanparham",
        "Comment": "Math was my arch enemy in school and always has been.  :(",
        "Likes": 1
    },
    {
        "idx": 543,
        "Username": "grant-pearson-13aa181a",
        "Comment": "The word is 'maths'..... probably the only thing I'll know more than Bill in this lifetime 😁",
        "Likes": 1
    },
    {
        "idx": 544,
        "Username": "ceci-quintana",
        "Comment": "Thank you ! :)",
        "Likes": 1
    },
    {
        "idx": 545,
        "Username": "ayubtar",
        "Comment": "Www.atiscg.com supports this message",
        "Likes": 1
    },
    {
        "idx": 546,
        "Username": "tedrand",
        "Comment": "Nice custom cover art!",
        "Likes": 1
    },
    {
        "idx": 547,
        "Username": "adrian-luzuriaga-26813a45",
        "Comment": "I like all of these subjects.  I like being in school.",
        "Likes": 1
    },
    {
        "idx": 548,
        "Username": "jerome-as",
        "Comment": "This is a tough one because I enjoyed most of them.",
        "Likes": 1
    },
    {
        "idx": 549,
        "Username": "golfam-batebi",
        "Comment": "Although Math always was and still is my favourite subject, thanks for the recommendation!",
        "Likes": 1
    },
    {
        "idx": 550,
        "Username": "nataliaherculino",
        "Comment": "History. And great playlist!",
        "Likes": 2
    },
    {
        "idx": 551,
        "Username": "tigue-howe-7934598",
        "Comment": "I hated all of them.",
        "Likes": 1
    },
    {
        "idx": 552,
        "Username": "kally-sanneh-767719162",
        "Comment": "Biology ",
        "Likes": 1
    },
    {
        "idx": 553,
        "Username": "rick-staula-04990061",
        "Comment": "the history they taught us were lies.",
        "Likes": 1
    },
    {
        "idx": 554,
        "Username": "harvey-rodstein-910a366",
        "Comment": "Sry. I liked them all and equally disdained them all.",
        "Likes": 1
    },
    {
        "idx": 555,
        "Username": "grace-rivera-cpa-983674",
        "Comment": "My fave subject was Math. Cause I don’t need to study or memorize anything.",
        "Likes": 1
    },
    {
        "idx": 556,
        "Username": "vincent-pinte-deregnaucourt",
        "Comment": "or you just can add all songs : you get a full integral.",
        "Likes": 1
    },
    {
        "idx": 557,
        "Username": "steven-somogyi-4245168",
        "Comment": "Poor/weak teaching can make any subject a least favorite, and vice-versa.   ",
        "Likes": 2
    },
    {
        "idx": 558,
        "Username": "hamidreza-hres-515214140",
        "Comment": "DOS 6.22",
        "Likes": 1
    },
    {
        "idx": 559,
        "Username": "gerben-van-vlimmeren-534b1b12",
        "Comment": "It's not that I hated math. I hated the fully incompetent teachers and methods. ",
        "Likes": 1
    },
    {
        "idx": 560,
        "Username": "theresakushner",
        "Comment": "It was PE",
        "Likes": 1
    },
    {
        "idx": 561,
        "Username": "gberrocal",
        "Comment": "I liked all of the above,  my least favorite was chemistry ",
        "Likes": 1
    },
    {
        "idx": 562,
        "Username": "chara-ann-tappin-mccabe-8225385",
        "Comment": "I liked them all... just struggled in math with bad teachers.",
        "Likes": 1
    },
    {
        "idx": 563,
        "Username": "eliecer-guerra-188248a8",
        "Comment": "Th funnest was science...even when it had math in it.",
        "Likes": 1
    },
    {
        "idx": 564,
        "Username": "ajaykumarmishra",
        "Comment": "All",
        "Likes": 0
    },
    {
        "idx": 565,
        "Username": "rafarosacastejon",
        "Comment": "Free Hour",
        "Likes": 1
    },
    {
        "idx": 566,
        "Username": "billryan28",
        "Comment": "I’m feeling so much joy from seeing Built To Spill on this playlist",
        "Likes": 1
    },
    {
        "idx": 567,
        "Username": "michael-bowen-747a7713a",
        "Comment": "All four. HA HA",
        "Likes": 1
    },
    {
        "idx": 568,
        "Username": "sriram-ramanan",
        "Comment": "History. But that has changed now.. Knowing the right history is so important.",
        "Likes": 1
    },
    {
        "idx": 569,
        "Username": "darioloureiro",
        "Comment": "Geography",
        "Likes": 1
    },
    {
        "idx": 570,
        "Username": "tahir-haq-88020161",
        "Comment": "History. It gets longer and longer every year.",
        "Likes": 1
    },
    {
        "idx": 571,
        "Username": "robert-tangen-a92301",
        "Comment": "None of them",
        "Likes": 1
    },
    {
        "idx": 572,
        "Username": "pajakkrzysztof",
        "Comment": "Like them all!",
        "Likes": 1
    },
    {
        "idx": 573,
        "Username": "mark-liddell",
        "Comment": "I liked all those subjects",
        "Likes": 1
    },
    {
        "idx": 574,
        "Username": "stewart-nolan-a22544b",
        "Comment": "Computer Science....so there ",
        "Likes": 1
    },
    {
        "idx": 575,
        "Username": "matthew-pinard-029846183",
        "Comment": "Learning about Nazis experiments on people bodies with vaccines",
        "Likes": 1
    },
    {
        "idx": 576,
        "Username": "bitastaroymehta",
        "Comment": "Azzama Rabbi",
        "Likes": 0
    },
    {
        "idx": 577,
        "Username": "filippo-santarelli",
        "Comment": "None of them, I loved them all",
        "Likes": 1
    },
    {
        "idx": 578,
        "Username": "klaas-tol",
        "Comment": "Without science You don t need MATH",
        "Likes": 1
    },
    {
        "idx": 579,
        "Username": "emmanueltangas",
        "Comment": "Typing class. I figured I'd never use it. :)",
        "Likes": 1
    },
    {
        "idx": 580,
        "Username": "victoria-baillie-a09049126",
        "Comment": "Math was my Achilles heel at school!",
        "Likes": 1
    },
    {
        "idx": 581,
        "Username": "mauricio-allende-alarcón-7a6b0934",
        "Comment": "Hard to say. I liked all. ",
        "Likes": 1
    },
    {
        "idx": 582,
        "Username": "vijay-sai-raj-r",
        "Comment": "Computer Science",
        "Likes": 1
    },
    {
        "idx": 583,
        "Username": "anil-kumar-273016231",
        "Comment": "History ",
        "Likes": 1
    },
    {
        "idx": 584,
        "Username": "neil-goodman-43779516",
        "Comment": "None of the above. It was music",
        "Likes": 1
    },
    {
        "idx": 585,
        "Username": "terrikarelle",
        "Comment": "Physics",
        "Likes": 1
    },
    {
        "idx": 586,
        "Username": "luck-eyaga-a745b9183",
        "Comment": "We wait you Big boss Bill Gates  #senegal",
        "Likes": 1
    },
    {
        "idx": 587,
        "Username": "michael-robison-b6605a10",
        "Comment": "I liked all of them. Still do. 🤓",
        "Likes": 1
    },
    {
        "idx": 588,
        "Username": "goran-saleh-707890153",
        "Comment": "Physic",
        "Likes": 1
    },
    {
        "idx": 589,
        "Username": "alina-astrakova",
        "Comment": "\"Other\" is missing for completeness 🙂",
        "Likes": 1
    },
    {
        "idx": 590,
        "Username": "brian-stoneman-898a2b65",
        "Comment": "Religious Studies...... By far the worst subject. ",
        "Likes": 1
    },
    {
        "idx": 591,
        "Username": "mahboubeh-safaeii-39ba88199",
        "Comment": "\nThey are all attractive 😊 😍 ",
        "Likes": 1
    },
    {
        "idx": 592,
        "Username": "andrewcwhittaker",
        "Comment": "The answer is “don’t force vaccines on us”",
        "Likes": 1
    },
    {
        "idx": 593,
        "Username": "ronengineer",
        "Comment": "I like Twenty Five Miles by Edwin Starr , groovy for my runs. Thanks.",
        "Likes": 1
    },
    {
        "idx": 594,
        "Username": "alex-schmidt-a4a6451ab",
        "Comment": "Economics",
        "Likes": 1
    },
    {
        "idx": 595,
        "Username": "yash-bisht1405",
        "Comment": "History, Hard to remember all those dates",
        "Likes": 1
    },
    {
        "idx": 596,
        "Username": "imadayad",
        "Comment": "One option is missing ",
        "Likes": 1
    },
    {
        "idx": 597,
        "Username": "carolyn-wilson-91719513",
        "Comment": "It’s all about the teachers",
        "Likes": 1
    },
    {
        "idx": 598,
        "Username": "ting-ting-hu",
        "Comment": "It’s actually history 😂",
        "Likes": 1
    },
    {
        "idx": 599,
        "Username": "adel-asem-kandil",
        "Comment": "Bill Gates math \" programming \"",
        "Likes": 2
    },
    {
        "idx": 600,
        "Username": "oryair",
        "Comment": "Class at four o'clock, the classic run home class.",
        "Likes": 1
    },
    {
        "idx": 601,
        "Username": "stevenbosmanromein",
        "Comment": "Probably between math and German. I was just so bad at math...",
        "Likes": 1
    },
    {
        "idx": 602,
        "Username": "marios-paschakis-5b787414",
        "Comment": "More options please Bill!",
        "Likes": 1
    },
    {
        "idx": 603,
        "Username": "greg-conley",
        "Comment": "Loved them all Bill Gates 🤟",
        "Likes": 1
    },
    {
        "idx": 604,
        "Username": "greg-conley",
        "Comment": "Loved them all Bill Gates 🤟",
        "Likes": 1
    },
    {
        "idx": 605,
        "Username": "justingobyfields",
        "Comment": "You left out music and art",
        "Likes": 1
    },
    {
        "idx": 606,
        "Username": "fabrício-pires-214aa13b",
        "Comment": "Oi tio Bill",
        "Likes": 1
    },
    {
        "idx": 607,
        "Username": "teslime-güğül-a356b397",
        "Comment": "Please add one more option for Laugh-ology 🫡",
        "Likes": 2
    },
    {
        "idx": 608,
        "Username": "davidjohns28",
        "Comment": "Cool.",
        "Likes": 1
    },
    {
        "idx": 609,
        "Username": "mustafa-mohammed-6ab38593",
        "Comment": "French",
        "Likes": 1
    },
    {
        "idx": 610,
        "Username": "andreww1",
        "Comment": "Funny, Love History now. ",
        "Likes": 1
    },
    {
        "idx": 611,
        "Username": "margaret-collins-2476211a",
        "Comment": "Sport",
        "Likes": 1
    },
    {
        "idx": 612,
        "Username": "rcjavier",
        "Comment": "https://spotify.link/EEwj8Bs4DDb",
        "Likes": 1
    },
    {
        "idx": 613,
        "Username": "benlopezra",
        "Comment": "Bill Gates 🙌 ",
        "Likes": 1
    },
    {
        "idx": 614,
        "Username": "brian-karem-429b747",
        "Comment": "I'm a freak. I LOVED all of those subjects.",
        "Likes": 1
    },
    {
        "idx": 615,
        "Username": "michael-cenzer",
        "Comment": "French",
        "Likes": 1
    },
    {
        "idx": 616,
        "Username": "vivekvermanz",
        "Comment": "Math",
        "Likes": 1
    },
    {
        "idx": 617,
        "Username": "tahmina-parvin-p-e-a85a274",
        "Comment": "All 4",
        "Likes": 1
    },
    {
        "idx": 618,
        "Username": "smithchaigneau",
        "Comment": "Boring",
        "Likes": 1
    }
]